#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает соответствие кодов планируемого статуса маркируемого товара значению перечисления
// 
// Возвращаемое значение:
//  Соответствие
//
Функция КодыПланируемыхСтатусовМаркируемогоТовара() Экспорт
	
	Соответствие = Новый Соответствие(); 
	Соответствие.Вставить(ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварРеализован"), 1);
	Соответствие.Вставить(ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.МерныйТоварВСтадииРеализации"), 2);
	Соответствие.Вставить(ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварВозвращен"), 3);
	Соответствие.Вставить(ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ЧастьТовараВозвращена"), 4);
	Соответствие.Вставить(ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.СтатусТовараНеИзменился"), 255);
	Возврат Соответствие;
	
КонецФункции

// Возвращает соответствие планируемых статусов маркируемого товара коду
// 
// Возвращаемое значение:
//  Соответствие
//
Функция ПланируемыеСтатусыМаркируемогоТовараПоКоду() Экспорт
	
	Соответствие = Новый Соответствие(); 
	Соответствие.Вставить(1, ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварРеализован"));
	Соответствие.Вставить(2, ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.МерныйТоварВСтадииРеализации"));
	Соответствие.Вставить(3, ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварВозвращен"));
	Соответствие.Вставить(4, ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ЧастьТовараВозвращена"));
	Соответствие.Вставить(255, ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.СтатусТовараНеИзменился"));
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти

#КонецЕсли