// GRACE:MODULE_START name="ПроизводствоВСД"
// @grace-module: ПроизводствоВСД
// @grace-purpose: Команда открытия формы лабораторных исследований из документа ВСД2_Производство
// @grace-depends: ПроизводствоВСД
// @grace-version: 1.0
// @grace-contract-ref: docs/Contracts.xml -> module="ПроизводствоВСД"
// GRACE:DEPENDENCY target="Обработка.кб99_ЛабИсследования"

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("Док", ПараметрКоманды);
	ОткрытьФорму("Обработка.кб99_ЛабИсследования.Форма.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);

КонецПроцедуры
// GRACE:MODULE_END name="ПроизводствоВСД"
