
&НаСервере
Процедура ВыполнитьНаСервере(Знач СписокПартий)
	
	Для Каждого ВыбПартия Из СписокПартий Цикл
		
		Организация = ВетИС_ЯдроСервер.ПолучитьОрганизациюПоХС(Выбпартия.Получатель_ХозСубъект);
		ПараметрыОрганизации = ВетИС_ЯдроСервер.ЗагрузитьПараметры(Организация);
	
		ПараметрыОрганизации["Отправитель_ХозСубъект"] = Выбпартия.Получатель_ХозСубъект;
		ПараметрыОрганизации["Отправитель_Площадка"] = ВыбПартия.Получатель_Площадка;
		ВетИС_APIСервер.Партии_ПолучитьПоGUID(ПараметрыОрганизации, ВыбПартия);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Состояние("Выполняем запрос", , "Ожидайте...", БиблиотекаКартинок.kb99_wrench);
	
	ВыполнитьНаСервере(ПараметрКоманды);
	
	ПоказатьОповещениеПользователя("Операция завершена");
	
КонецПроцедуры
