
&НаСервере
Процедура ВыполнитьНаСервере(ВыбПлощадка)
	
	// Вносить изменения в реквизиты площадки может только владелец
	Если ЗначениеЗаполнено(ВыбПлощадка.ХозСубъект) Тогда
		Организация = ВетИС_ЯдроСервер.ПолучитьОрганизациюПоХС(ВыбПлощадка.ХозСубъект);
	Иначе
		Организация = ВетИС_ПараметрыСервер.ПолучитьОрганизациюПоУмолчанию();
	КонецЕсли;
	
	ПараметрыОрганизации = ВетИС_ЯдроСервер.ЗагрузитьПараметры(Организация);
	
	ВетИС_APIСервер.Площадка_СвязатьСХозСубъектом(ПараметрыОрганизации, ВыбПлощадка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Состояние("Выполняем запрос",, "Ожидайте...", БиблиотекаКартинок.kb99_wrench);
	
	ВыполнитьНаСервере(ПараметрКоманды);
	
	ПоказатьОповещениеПользователя("Операция завершена");
	
КонецПроцедуры
