
&НаСервере
Процедура ВыполнитьНаСервере( СписокПлощадок )
	
	Организация = ВетИС_ПараметрыСервер.ПолучитьОрганизациюПоУмолчанию();
	ПараметрыОрганизации = ВетИС_ЯдроСервер.ЗагрузитьПараметры(Организация);
	
	Для Каждого ВыбПлощадка Из СписокПлощадок Цикл
		ВетИС_APIСервер.Площадка_ЗагрузитьПоGUID(ПараметрыОрганизации, ВыбПлощадка.GUID, ВыбПлощадка.ХозСубъект, ВыбПлощадка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Состояние("Выполняем запрос",, "Ожидайте...", БиблиотекаКартинок.kb99_wrench);
	
	ВыполнитьНаСервере(ПараметрКоманды);
	
	ПоказатьОповещениеПользователя("Операция завершена");
КонецПроцедуры
