#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает код вида оплаты на терминале
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//	* Ключ - ПеречислениеСсылка.ВидОплатыНаТерминале - Вид оплаты
//	* Значение - Число - Код вида оплаты.
//
Функция КодВидаОплатыНаТерминале() Экспорт
	
	СоответствиеВидаОплатыКодуОплаты = Новый Соответствие();
	СоответствиеВидаОплатыКодуОплаты.Вставить(ПредопределенноеЗначение("Перечисление.ВидОплатыНаТерминале.Карта")  , 0);
	СоответствиеВидаОплатыКодуОплаты.Вставить(ПредопределенноеЗначение("Перечисление.ВидОплатыНаТерминале.СБПQR")  , 1);
	СоответствиеВидаОплатыКодуОплаты.Вставить(ПредопределенноеЗначение("Перечисление.ВидОплатыНаТерминале.ПлатиQR"), 2);
	Возврат СоответствиеВидаОплатыКодуОплаты;
	
КонецФункции

// Возвращает вид оплаты на терминале по коду.
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//	* Ключ - Число - Код вида оплаты
//	* Значение - ПеречислениеСсылка.ВидОплатыНаТерминале - Вид оплаты.
//
Функция ВидОплатыНаТерминалеПоКоду() Экспорт
	
	СоответствиеКодаОплатыВидуОплаты = Новый Соответствие();
	СоответствиеКодаОплатыВидуОплаты.Вставить(0, ПредопределенноеЗначение("Перечисление.ВидОплатыНаТерминале.Карта"));
	СоответствиеКодаОплатыВидуОплаты.Вставить(1, ПредопределенноеЗначение("Перечисление.ВидОплатыНаТерминале.СБПQR"));
	СоответствиеКодаОплатыВидуОплаты.Вставить(2, ПредопределенноеЗначение("Перечисление.ВидОплатыНаТерминале.ПлатиQR"));
	Возврат СоответствиеКодаОплатыВидуОплаты;
	
КонецФункции

#КонецОбласти


#КонецЕсли