#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает код ответа ОИСМ о статусе товара
// 
// 
// Возвращаемое значение:
//  Соответствие
//
Функция КодыОтветаОИСМОСтатусеТовара() Экспорт
	
	Соответствие = Новый Соответствие(); 
	Соответствие.Вставить(ПредопределенноеЗначение("Перечисление.ОтветОИСМОСтатусеТовара.ПланируемыйСтатусТовараКорректен"), 1);
	Соответствие.Вставить(ПредопределенноеЗначение("Перечисление.ОтветОИСМОСтатусеТовара.ПланируемыйСтатусТовараНекорректен"), 2);
	Соответствие.Вставить(ПредопределенноеЗначение("Перечисление.ОтветОИСМОСтатусеТовара.ОборотТовараПриостановлен"), 3);
	
	Возврат Соответствие;
	
КонецФункции

// Возвращает ответы ОИСМ о статусе товара по коду.
// 
// 
// Возвращаемое значение:
//  Соответствие
//
Функция ОтветыОИСМОСтатусеТовараПоКоду() Экспорт
	
	Соответствие = Новый Соответствие(); 
	Соответствие.Вставить(1, ПредопределенноеЗначение("Перечисление.ОтветОИСМОСтатусеТовара.ПланируемыйСтатусТовараКорректен"));
	Соответствие.Вставить(2, ПредопределенноеЗначение("Перечисление.ОтветОИСМОСтатусеТовара.ПланируемыйСтатусТовараНекорректен"));
	Соответствие.Вставить(3, ПредопределенноеЗначение("Перечисление.ОтветОИСМОСтатусеТовара.ОборотТовараПриостановлен"));
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти


#КонецЕсли