
&НаСервере
Процедура ВыполнитьНаСервере(ПараметрКоманды)

	Организация = ВетИС_ПараметрыСервер.ПолучитьОрганизациюПоУмолчанию();
	ПараметрыОрганизации = ВетИС_ЯдроСервер.ЗагрузитьПараметры( Организация );
	
	Для Каждого ВыбХозСубъект Из ПараметрКоманды Цикл
		ВетИС_APIСервер.ХозСубъект_ПолучитьGuidПоИНН(ПараметрыОрганизации, ВыбХозСубъект);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Состояние("Выполняем запрос",, "Ожидайте...", БиблиотекаКартинок.kb99_wrench);
	
	ВыполнитьНаСервере(ПараметрКоманды);
	
	ПоказатьОповещениеПользователя("Операция завершена");
	
КонецПроцедуры
