
&НаСервере
Процедура ВыполнитьНаСервере(ПараметрКоманды)

	Организация = ВетИС_ПараметрыСервер.ПолучитьОрганизациюПоУмолчанию();
	ПараметрыОрганизации = ВетИС_ЯдроСервер.ЗагрузитьПараметры(Организация);
	
	//Для Каждого элемент Из ПараметрКоманды Цикл
		ВетИС_APIСервер.ХозСубъект_Создать(ПараметрыОрганизации, ПараметрКоманды);
	//КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Состояние("Выполняем запрос",, "Ожидайте...", БиблиотекаКартинок.kb99_wrench);
	//ВСД.Получить_Инфо_Продукции_Меркурий(ПараметрКоманды);
	
	ВыполнитьНаСервере(ПараметрКоманды);
	
	ПоказатьОповещениеПользователя("Операция завершена");
	
КонецПроцедуры
