
&НаСервере
Процедура ВыполнитьНаСервере(ВыбПлощадка)
	
	Организация = ВетИС_ПараметрыСервер.ПолучитьОрганизациюПоУмолчанию();
	ПараметрыОрганизации = ВетИС_ЯдроСервер.ЗагрузитьПараметры(Организация);
	
	ВетИС_APIСервер.Продукция_Элемент_ПолучитьСписокПоПлощадке(ПараметрыОрганизации, ВыбПлощадка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Состояние("Выполняем запрос", , "Ожидайте...", БиблиотекаКартинок.kb99_wrench);
	
	ВыполнитьНаСервере(ПараметрКоманды);
	
	ПоказатьОповещениеПользователя("Операция завершена");
	
КонецПроцедуры
