// GRACE:MODULE_START name="ВетИС_API_НСИСервер"
// @grace-module: ВетИС_API_НСИСервер
// @grace-purpose: НСИ: продукция, виды продукции, единицы измерения, упаковки, цели
// @grace-depends: ВетИС_APIСервер, ВетИС_УтилитыКлиентСервер, ВетИС_ПараметрыСервер
// @grace-version: 1.0
// @grace-contract-ref: docs/Contracts.xml -> module="ВетИС_API_НСИСервер"
// GRACE:DEPENDENCY target="ВетИС_APIСервер"
// GRACE:DEPENDENCY target="ВетИС_УтилитыКлиентСервер"
// GRACE:DEPENDENCY target="ВетИС_ПараметрыСервер"

Функция ИнициализацияХС_ЗагрузитьВсеСправочники(Параметры, АдресХранилища) Экспорт
	
	Отправитель_ХозСубъект = ВетИС_API_ПлощадкиСервер.ХозСубъект_ЗагрузитьПоGUID(Параметры, Параметры["param_issuer_id"]);
	Если НЕ ЗначениеЗаполнено(Отправитель_ХозСубъект) Тогда
		ВетИС_APIСервер.СообщитьИнфо("Не удалось получить ХС по указанному Issuer_id - проверьте корректность введенных данных");
		Возврат Ложь;
	КонецЕсли;
	
	ЗапросXML = ВетИС_API_ПлощадкиСервер.ХозСубъект_ЗагрузитьПоGUID_Запрос(Параметры["param_issuer_id"]);
	Service = "platform/services/2.1/EnterpriseService";
	Action = "GetBusinessEntityByGUID";
	
	ВетИС_APIСервер.СообщитьИнфо(" Запрос GetBusinessEntityByGUID [ " + Параметры["param_issuer_id"] + " ]");
	ПараметрыОтправки = кб99_ВСД_Отправка.ПараметрыОтправкиИнициализация(Параметры);
	ПараметрыОтправки.ЗапросXML = ЗапросXML;
	ПараметрыОтправки.Service = Service;
	ПараметрыОтправки.Action = Action;
	
	xdto = кб99_ВСД_Отправка.ОтправитьSOAPНаСервере(ПараметрыОтправки);
	
	Попытка
		businessEntity = xdto.Body.getBusinessEntityByGuidResponse.businessEntity;
		
		_guid = businessEntity.guid;
		_uuid = businessEntity.uuid;
		active = businessEntity.active;
		Если НЕ (businessEntity.Свойства().Получить("name") = Неопределено) Тогда
			name = businessEntity.name;
		ИначеЕсли НЕ (businessEntity.Свойства().Получить("fio") = Неопределено) Тогда
			name = businessEntity.fio;
		Иначе
			name = "";
			ВетИС_APIСервер.СообщитьИнфо("Имя ХС отсутствует в ответе");
		КонецЕсли;
		
		country = businessEntity.juridicalAddress.country.guid;
		countryName = businessEntity.juridicalAddress.country.name;
		
		Параметры["Страна"] = ВетИС_API_АдресаСервер.НайтиСтрануПоGUID(country, countryName);
		ВетИС_API_АдресаСервер.ИнициализацияХС_ЗагрузитьРегионы(Параметры, Параметры["Страна"]);
		
		region = businessEntity.juridicalAddress.region.guid;
		regionName = businessEntity.juridicalAddress.region.name;
		
		Параметры["Регион"] = ВетИС_API_АдресаСервер.НайтиРегионПоGUID(region, regionName, Параметры["Страна"]);
		
		Попытка 
			locality = businessEntity.juridicalAddress.locality.guid;
			localityName = businessEntity.juridicalAddress.locality.name;
			Параметры["Город"] = ВетИС_API_АдресаСервер.НайтиГородПоGUID(locality, localityName, Параметры["Регион"]);
		Исключение
			ВетИС_APIСервер.СообщитьИнфо("Город не указан в juridicalAddress. Загрузите города вручную");
		КонецПопытки;
		
		Если Параметры["param_issuer_id"] <> _guid Тогда
			ВетИС_APIСервер.СообщитьИнфо("Ошибка в param_issuer_id, должно быть " + _guid);
		КонецЕсли;
		
		ИнициализацияХС_ЗагрузитьЦели(Параметры);
		ИнициализацияХС_ЗагрузитьЕдиницыИзмерения(Параметры);
		ЗаполнитьФормыУпаковки(Параметры, АдресХранилища);
		ИнициализацияХС_ЗагрузитьПродукцию_Все(Параметры, АдресХранилища);
		
		ВетИС_API_ПлощадкиСервер.Площадка_ЗагрузитьПоХозСубъекту(Параметры, Отправитель_ХозСубъект);
		
		РезультатОбработки = Новый Структура();
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Истина);
		РезультатОбработки.Вставить("Параметры", Параметры);
		ВетИС_APIСервер.СообщитьИнфо("Инициализация завершена. Выберите основную Площадку.");
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при Инициализации'"),
		                         УровеньЖурналаРегистрации.Ошибка, , ,
		                         ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
		                         );
		
		РезультатОбработки = Новый Структура();
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Ложь);
		
		ВетИС_APIСервер.СообщитьИнфо("Ошибка при Инициализации "+ОписаниеОшибки());
	КонецПопытки;
	
	ПоместитьВоВременноеХранилище(РезультатОбработки, АдресХранилища);
	
КонецФункции

Функция ЗагрузитьПродукцию_ЗапросXML(тип) Экспорт
	
	Запрос = "
	|<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/' 
	|xmlns:ws='http://api.vetrf.ru/schema/cdm/registry/ws-definitions/v2' 
	|xmlns:bs='http://api.vetrf.ru/schema/cdm/base' 
	|xmlns:dt='http://api.vetrf.ru/schema/cdm/dictionary/v2'>
	|   <soapenv:Header/>
	|   <soapenv:Body>
	|      <ws:getProductByTypeListRequest>
	|   	<bs:listOptions>
	|           <bs:count>1000</bs:count>
	|           <bs:offset>0</bs:offset>
	|        </bs:listOptions>
	|        <dt:productType>" + тип + "</dt:productType>
	|      </ws:getProductByTypeListRequest>
	|   </soapenv:Body>
	|</soapenv:Envelope>
	|";
	Возврат Запрос;
	
КонецФункции

Процедура ИнициализацияХС_ЗагрузитьПродукцию_Все(Знач Параметры, АдресХранилища) Экспорт
	
	ВетИС_APIСервер.ПометитьНаУдалениеСправочник("ВСД_ВидПродукции");
	ВетИС_APIСервер.ПометитьНаУдалениеСправочник("ВСД_Продукция");
	
	Для А = 1 По 8 Цикл
		Ответ = ИнициализацияХС_ЗагрузитьПродукцию(Параметры, А);
	КонецЦикла;
	
	РезультатОбработки = Новый Структура();
	Если Ответ Тогда
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Истина);
	Иначе
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Ложь);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатОбработки, АдресХранилища);
	
КонецПроцедуры

Процедура ИнициализацияХС_ЗагрузитьПродукцию_ВФоне(Знач Параметры, АдресХранилища) Экспорт
	
	Если ЗначениеЗаполнено(Параметры["Тип"]) Тогда
		ТипПродукции = Параметры["Тип"];
	Иначе
		ВетИС_APIСервер.СообщитьИнфо("Значение ТИП не заполнено");
		ТипПродукции = 1;
	КонецЕсли;
	
	
	Ответ = ИнициализацияХС_ЗагрузитьПродукцию(Параметры, ТипПродукции);
	РезультатОбработки = Новый Структура();
	Если Ответ Тогда
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Истина);
	Иначе
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Ложь);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатОбработки, АдресХранилища);
	
КонецПроцедуры 

Функция ИнициализацияХС_ЗагрузитьПродукцию(Параметры, ТипПродукции) Экспорт
	
	ВетИС_APIСервер.СообщитьИнфо(" Запрос GetProductList " + ТипПродукции);
	ЗапросXML = ЗагрузитьПродукцию_ЗапросXML(ТипПродукции);
	Service = "platform/services/2.1/ProductService";
	Action = "GetProductByTypeList";
	
	ПараметрыОтправки = кб99_ВСД_Отправка.ПараметрыОтправкиИнициализация(Параметры);
	ПараметрыОтправки.ЗапросXML = ЗапросXML;
	ПараметрыОтправки.Service = Service;
	ПараметрыОтправки.Action = Action;
	
	xdto = кб99_ВСД_Отправка.ОтправитьSOAPНаСервере(ПараметрыОтправки);
	
	Ответ = Ложь;
	
	// НачатьТранзакцию();
	Попытка
		productList = xdto.Body.getProductByTypeListResponse.productList.product;
		Для каждого product ИЗ productList Цикл
			
			_guid = product.guid;
			_uuid = product.uuid;
			name = product.name;
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	ВСД_Продукция.Ссылка
			|ИЗ
			|	Справочник.ВСД_Продукция КАК ВСД_Продукция
			|ГДЕ
			|	ВСД_Продукция.GUID = &GUID");
			Запрос.УстановитьПараметр("GUID", _guid);
			
			Результат = Запрос.Выполнить().Выбрать();
			
			Если Результат.Следующий() Тогда
				Ответ = Результат.Ссылка;
				Спр = Результат.Ссылка.ПолучитьОбъект();
				Спр.УстановитьПометкуУдаления(Ложь);
			Иначе
				ВетИС_APIСервер.СообщитьИнфо("ВСД_Продукция [" + name + "] GUID [" + _guid + "] добавлена");
				Спр = Справочники.ВСД_Продукция.СоздатьЭлемент();
			КонецЕсли;
			Спр.Наименование = name;
			Спр.GUID = _guid;
			Спр.UUID = _UUID;
			Попытка 
				Спр.КодТНВЭД = ?(ТипЗнч(product.code) = Тип("Строка"), product.code, "");
			Исключение
				Спр.КодТНВЭД = "";
			КонецПопытки;
			
			Спр.Тип = product.ProductType;
			Спр.Записать();
			Ответ = Спр.Ссылка;
			
			ИнициализацияХС_ЗагрузитьВидыПродукции(Параметры, _guid, Спр.Ссылка);
			
			Ответ = Истина;
		КонецЦикла;
		
		// ЗафиксироватьТранзакцию();
		ВетИС_APIСервер.СообщитьИнфо("Загрузка ВСД_Продукция завершена");
	Исключение
	
		// ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при получении ВСД_Продукция'"),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Ответ = Ложь;
		ВетИС_APIСервер.СообщитьИнфо("Ошибка при получении ВСД_Продукция " + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция НайтиПродукцию(guid) Экспорт
	
	Если ПустаяСтрока(guid) = 0 Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ВСД_Продукция.Ссылка
		|ИЗ
		|	Справочник.ВСД_Продукция КАК ВСД_Продукция
		|ГДЕ
		|	ВСД_Продукция.GUID = &GUID");
		Запрос.УстановитьПараметр("GUID", Guid);
		
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			Ответ = Результат.Ссылка;
		Иначе
			ВетИС_APIСервер.СообщитьИнфо("ВСД_Продукция Guid " + guid + " не найдена. Выполните инициализацию");
			Ответ = Справочники.ВСД_Продукция.ПустаяСсылка();
		КонецЕсли;
	Иначе
		ВетИС_APIСервер.СообщитьИнфо("Пустой Guid ВСД_Продукция");
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ЗагрузитьВидыПродукции_ЗапросXML(_guid, Смещение = 0) Экспорт
	
	Запрос = "
	|<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/'
	|	xmlns:ws='http://api.vetrf.ru/schema/cdm/registry/ws-definitions/v2' 
	|	xmlns:bs='http://api.vetrf.ru/schema/cdm/base' 
	|	xmlns:dt='http://api.vetrf.ru/schema/cdm/dictionary/v2'>
	|    <soapenv:Header/>
	|    <soapenv:Body>
	|      <ws:getSubProductByProductListRequest>
	|          <bs:listOptions>
	|            <bs:count>1000</bs:count>
	|            <bs:offset>" + Формат(Смещение, "ЧДЦ=0; ЧН=0; ЧГ=") + "</bs:offset>
	|         </bs:listOptions>
	|         <dt:productGuid>" + _guid + "</dt:productGuid>
	|      </ws:getSubProductByProductListRequest>
	|    </soapenv:Body>
	|</soapenv:Envelope>
	|";
	Возврат Запрос;
	
КонецФункции

Функция ИнициализацияХС_ЗагрузитьВидыПродукции(Знач Параметры, ВидПродукцииGUID, Владелец, _Смещение = 0) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Владелец) ИЛИ Владелец = Справочники.ВСД_Продукция.ПустаяСсылка() Тогда
		ВетИС_APIСервер.СообщитьИнфо("Не указан владелец " + ВидПродукцииGUID);
		Возврат Ложь;
	КонецЕсли;
	
	ВетИС_APIСервер.СообщитьИнфо(" Запрос GetProductList ");
	ЗапросXML = ЗагрузитьВидыПродукции_ЗапросXML(ВидПродукцииGUID, _Смещение);
	Service = "platform/services/2.1/ProductService";
	Action = "GetSubProductByProductList";
	ПараметрыОтправки = кб99_ВСД_Отправка.ПараметрыОтправкиИнициализация(Параметры);
	ПараметрыОтправки.ЗапросXML = ЗапросXML;
	ПараметрыОтправки.Service = Service;
	ПараметрыОтправки.Action = Action;
	
	xdto = кб99_ВСД_Отправка.ОтправитьSOAPНаСервере(ПараметрыОтправки);
	
	КолвоПолучено = Число(xdto.Body.getSubProductByProductListResponse.subProductList.count);
	Если КолвоПолучено > 0 Тогда
		//НачатьТранзакцию();
		Попытка
			Если ТипЗнч(xdto.Body.getSubProductByProductListResponse.subProductList.subProduct) <> Тип("СписокXDTO") Тогда
				subProductList = Новый Массив;
				subProductList.Добавить(xdto.Body.getSubProductByProductListResponse.subProductList.subProduct);
			Иначе
				subProductList = xdto.Body.getSubProductByProductListResponse.subProductList.subProduct;
			КонецЕсли;
			
			Для каждого subProduct ИЗ subProductList Цикл
				
				_guid = subProduct.guid;
				_uuid = subProduct.uuid;
				name = subProduct.name;
				
				Запрос = Новый Запрос("ВЫБРАТЬ
				|	ВСД_ВидПродукции.Ссылка
				|ИЗ
				|	Справочник.ВСД_ВидПродукции КАК ВСД_ВидПродукции
				|ГДЕ
				|	ВСД_ВидПродукции.GUID = &GUID");
				Запрос.УстановитьПараметр("GUID", _guid);
				
				Результат = Запрос.Выполнить().Выбрать();
				
				Если Результат.Следующий() Тогда
					Ответ = Результат.Ссылка;
					Спр = Результат.Ссылка.ПолучитьОбъект();
					Спр.УстановитьПометкуУдаления(Ложь);
					ВетИС_APIСервер.СообщитьИнфо("ВСД_ВидПродукции [" + name + "] GUID [" + _guid + "] обновлена");
				Иначе
					ВетИС_APIСервер.СообщитьИнфо("ВСД_ВидПродукции [" + name + "] GUID [" + _guid + "] добавлена");
					Спр = Справочники.ВСД_ВидПродукции.СоздатьЭлемент();
				КонецЕсли;
				Спр.Владелец = Владелец;
				Спр.Наименование = name;
				Спр.GUID = _guid;
				Спр.UUID = _UUID;
				Попытка
					Спр.КодТНВЭД = ?(ТипЗнч(subProduct.code) = Тип("Строка"), subProduct.code,"");
				Исключение
					Спр.КодТНВЭД = "";
				КонецПопытки;
				
				Спр.Записать();
				Ответ = Спр.Ссылка;
				
			КонецЦикла;
			
			//ЗафиксироватьТранзакцию();
			Если КолвоПолучено = 1000 Тогда
				_Смещение = _Смещение + КолвоПолучено;
				ИнициализацияХС_ЗагрузитьВидыПродукции(Параметры, ВидПродукцииGUID, Владелец, _Смещение);
			КонецЕсли;
			
			Ответ = Истина;
		Исключение
			
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при получении ВСД_Продукция " + _guid + " '"),
				УровеньЖурналаРегистрации.Ошибка, , ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			//ОтменитьТранзакцию();
			
			Ответ = Ложь;
			ВетИС_APIСервер.СообщитьИнфо("Ошибка при получении ВСД_Продукция " + ОписаниеОшибки());
		КонецПопытки;
	Иначе
		ВетИС_APIСервер.СообщитьИнфо("Список ВСД_ВидПродукции Для " + Владелец + " пуст.");
		Ответ = Ложь;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция НайтиВидПродукции(guid) Экспорт
	
	Если ПустаяСтрока(guid) = 0 Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ВСД_ВидПродукции.Ссылка
		|ИЗ
		|	Справочник.ВСД_ВидПродукции КАК ВСД_ВидПродукции
		|ГДЕ
		|	ВСД_ВидПродукции.GUID = &GUID");
		Запрос.УстановитьПараметр("GUID", Guid);
		
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда 
			Ответ = Результат.Ссылка;
		Иначе
			ВетИС_APIСервер.СообщитьИнфо("ВСД_ВидПродукции Guid " + guid + " не найдена. Выполните инициализацию");
			Ответ = Справочники.ВСД_ВидПродукции.ПустаяСсылка();
		КонецЕсли;
	Иначе
		ВетИС_APIСервер.СообщитьИнфо("Пустой Guid ВСД_ВидПродукции");
		Ответ = "";
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Процедура Продукция_Элемент_Получить_Инфо_ВФоне(Знач Параметры, АдресХранилища) Экспорт
	
	Выб_ВСД_Продукция_Элемент = Параметры["Выб_ВСД_Продукция_Элемент"];
	Если НЕ ЗначениеЗаполнено(Выб_ВСД_Продукция_Элемент) Тогда
		ВетИС_APIСервер.СообщитьИнфо("Выберите ВСД_Продукция_Элемент Для получения информации о ней");
		Возврат;
	КонецЕсли;
	
	Ответ = Продукция_Элемент_Получить_Инфо(Параметры, Выб_ВСД_Продукция_Элемент);
	РезультатОбработки = Новый Структура();
	Если Ответ Тогда
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Истина);
	Иначе
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Ложь);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатОбработки, АдресХранилища);
	
КонецПроцедуры 

Функция Продукция_Элемент_Получить_Инфо_ЗапросXML(продукция) Экспорт
	
	Запрос = "<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/' 
	|xmlns:ws='http://api.vetrf.ru/schema/cdm/registry/ws-definitions/v2' 
	|xmlns:base='http://api.vetrf.ru/schema/cdm/base'>
	|<soapenv:Header/>
	|<soapenv:Body>
	|<ws:getProductItemByGuidRequest>
	|<base:guid>" + СокрЛП(продукция.GUID) + "</base:guid>
	|</ws:getProductItemByGuidRequest>
	|</soapenv:Body>
	|</soapenv:Envelope>
	|";
	
	Возврат запрос;
	
КонецФункции

Функция Продукция_Элемент_Получить_Инфо(Знач Параметры, ВыбПродукцияЭлемент) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВыбПродукцияЭлемент) Тогда
		ВетИС_APIСервер.СообщитьИнфо("Укажите Продукцию Для получения информации о ней");
		Возврат Ложь;
	КонецЕсли;
	
	Если ПустаяСтрока(ВыбПродукцияЭлемент.GUID) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗапросXML = Продукция_Элемент_Получить_Инфо_ЗапросXML(ВыбПродукцияЭлемент);
	
	Service = "platform/services/2.1/ProductService";
	Action = "GetProductItemByGuid";
	
	ПараметрыОтправки = кб99_ВСД_Отправка.ПараметрыОтправкиИнициализация(Параметры);
	ПараметрыОтправки.ЗапросXML = ЗапросXML;
	ПараметрыОтправки.Service = Service;
	ПараметрыОтправки.Action = Action;
	xdto = кб99_ВСД_Отправка.ОтправитьSOAPНаСервере(ПараметрыОтправки);
	
	Результат = ПолучитьРезультат_Список_Продукции(Параметры, xdto, ВыбПродукцияЭлемент, Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьРезультат_Список_Продукции(Параметры, xdto, ВыбПродукцияЭлемент="", Площадка) Экспорт
	
	Попытка
		productItems = xdto.Body.getProductItemListResponse.productItemList.productItem;
	Исключение
		productItems = "";
	КонецПопытки;
	
	Если (ТипЗнч(productItems) <> Тип("СписокXDTO")) И (ТипЗнч(productItems) <> Тип("ОбъектXDTO")) Тогда
		// Изменение, добавление
		Попытка
			productItems = xdto.Body.result.modifyProducerStockListResponse.productItemList.productItem;
		Исключение
			productItems = "";
		КонецПопытки;
	КонецЕсли;
	
	Если (ТипЗнч(productItems) <> Тип("СписокXDTO")) И (ТипЗнч(productItems) <> Тип("ОбъектXDTO")) Тогда
		// Изменение, добавление
		Попытка
			productItems = xdto.Body.receiveApplicationResultResponse.application.result.modifyProducerStockListResponse.productItemList.productItem;
		Исключение
			productItems = "";
		КонецПопытки;
	КонецЕсли;
	
	Если (ТипЗнч(productItems) <> Тип("СписокXDTO")) И (ТипЗнч(productItems) <> Тип("ОбъектXDTO")) Тогда
		Попытка
			productItems = xdto.Body.getProductItemByGuidResponse.productItem;
		Исключение
			productItems = "";
		КонецПопытки;
	КонецЕсли;
	
	Если (ТипЗнч(productItems)<>Тип("СписокXDTO")) И (ТипЗнч(productItems)<>Тип("ОбъектXDTO")) Тогда
		ВетИС_APIСервер.СообщитьИнфо("Не удалось загрузить продукцию");
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(productItems)=Тип("СписокXDTO") Тогда
		productItemМассив = productItems;
	Иначе
		productItemМассив = Новый Массив;
		productItemМассив.Добавить(productItems);
	КонецЕсли;
	
	//НачатьТранзакцию();
	Попытка
		Для каждого productItem ИЗ productItemМассив Цикл
			
			Продукция = НайтиПродукцию(productItem.product.guid);
			ВидПродукции = НайтиВидПродукции(productItem.subProduct.guid);
			
			Если ЗначениеЗаполнено(ВыбПродукцияЭлемент) Тогда
				СпрОбъект = ВыбПродукцияЭлемент.ПолучитьОбъект();
			Иначе
				СпрСсылка = Продукция_Элемент_Найти(Параметры, productItem, Ложь);
				СпрОбъект = СпрСсылка.ПолучитьОбъект();
			КонецЕсли;
			
			СпрОбъект.Активен = productItem.active;
			СпрОбъект.UUID = productItem.uuid;
			СпрОбъект.GUID = productItem.guid;
			Попытка СпрОбъект.Наименование = productItem.name;
			Исключение
			КонецПопытки;
			СпрОбъект.Продукция = Продукция;
			СпрОбъект.ВидПродукции = ВидПродукции;
			Попытка СпрОбъект.Артикул = productItem.code;
			Исключение
			КонецПопытки;
			Попытка СпрОбъект.GTIN = productItem.globalID;
			Исключение
			КонецПопытки;
			Попытка СпрОбъект.СоответствуетГОСТу = ?(productItem.correspondsToGost = "true",1,0);
			Исключение СпрОбъект.СоответствуетГОСТу = 0;
			КонецПопытки;
			Попытка СпрОбъект.Гост = ?(типзнч(productItem.gost) = Тип("Строка"), productItem.gost, "");
			Исключение СпрОбъект.Гост = "";
			КонецПопытки;
			
			// Фасовка
			Попытка packaging = productItem.packaging
			Исключение packaging = "";
			КонецПопытки;
			Попытка ФасовкаНаименование = packaging.packagingType.name;
			Исключение ФасовкаНаименование = "";
			КонецПопытки;
			Попытка СпрОбъект.ФасовкаФормаУпаковки = НайтиФормуУпаковки(packaging.packagingType.guid,ФасовкаНаименование);
			Исключение
			КонецПопытки;
			Попытка СпрОбъект.ФасовкаКоличество = Число(packaging.quantity);
			Исключение
			КонецПопытки;
			Попытка СпрОбъект.ФасовкаОбъем = Число(packaging.volume);
			Исключение
			КонецПопытки;
			Попытка СпрОбъект.ФасовкаЕдиницаИзмерения = НайтиЕдИзмерения(packaging.unit.guid);
			Исключение
			КонецПопытки;
			
			Если НЕ ЗначениеЗаполнено(СпрОбъект.ТермическиеУсловияПеревозки) Тогда
				СпрОбъект.ТермическиеУсловияПеревозки = Параметры["ТермическиеУсловияПеревозки"];
			КонецЕсли;
			
			// productItem.producer.guid - ХС Производитель
			// productItem.producing.location.guid - Площадка-Производитель  - возможен список
			Попытка
				Если ТипЗнч(productItem.producing) = Тип("СписокXDTO") Тогда
					producingМассив = productItem.producing;
				Иначе
					producingМассив  = Новый Массив;
					producingМассив.Добавить(productItem.producing);
				КонецЕсли;
				Для Каждого producing ИЗ producingМассив Цикл
					СпрОбъект.Площадка = ВетИС_API_ПлощадкиСервер.Площадка_НайтиПоGUID(Параметры, producing.location.guid, Неопределено, Ложь, Истина);
				КонецЦикла
			Исключение
			КонецПопытки;
			СпрОбъект.Записать();
			Если НЕ СпрОбъект.Активен Тогда
				СпрОбъект.УстановитьПометкуУдаления(Истина);
				ВетИС_APIСервер.СообщитьИнфо("Помечен на удаление [" + productItem.name + "] uuid =[" + productItem.uuid + "], т.к. статус = НЕАКТИВЕН", СпрОбъект.Ссылка);
			Иначе
				ВетИС_APIСервер.СообщитьИнфо("Записан [" + productItem.name + "] uuid =[" + productItem.uuid + "]", СпрОбъект.Ссылка);
				Если СпрОбъект.ПометкаУдаления Тогда
					СпрОбъект.УстановитьПометкуУдаления(Ложь);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		// ЗафиксироватьТранзакцию();
		
		Если productItemМассив.Количество() = 1000 Тогда
			Параметры["Смещение"] = Параметры["Смещение"] + 1000;
			Продукция_Элемент_ПолучитьСписокПоПлощадке(Параметры, Площадка);
		КонецЕсли;
		
		Ответ = Истина;
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при получении ВСД_Продукция_Элемент " + productItem.guid + " '"),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		// ОтменитьТранзакцию();
		
		Ответ = Ложь;
		ВетИС_APIСервер.СообщитьИнфо("Ошибка при получении ВСД_Продукция_Элемент " + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция Продукция_Элемент_Найти(Знач Параметры, productItem, ОбновитьДанные = Истина,
	ВидПроисхожденияНеПищевойПродукции = Неопределено, ТермическиеУсловияПеревозки = Неопределено) Экспорт
	
	Попытка productItemName = productItem.name;
	Исключение productItemName = "";
	КонецПопытки;
	Попытка productItemGuid = productItem.guid;
	Исключение productItemGuid = "";
	КонецПопытки;
	Попытка productItemUuid = productItem.uuid;
	Исключение productItemUuid = "";
	КонецПопытки;
	
	Ответ = "";
	Если ЗначениеЗаполнено(productItemGuid) Тогда
		Запрос = Новый Запрос;
		ТекстЗапроса = "	ВЫБРАТЬ
		|	ВСД_Продукция_Элемент.Ссылка
		|ИЗ
		|	Справочник.ВСД_Продукция_Элемент КАК ВСД_Продукция_Элемент
		|ГДЕ
		|	ВСД_Продукция_Элемент.GUID = &GUID";
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("GUID", productItemGuid);
		Результат = Запрос.Выполнить().Выбрать();
	Иначе // нет ГУИД
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ВСД_Продукция_Элемент.Ссылка
		|ИЗ
		|	Справочник.ВСД_Продукция_Элемент КАК ВСД_Продукция_Элемент
		|ГДЕ
		|	ВСД_Продукция_Элемент.Наименование = &Название
		|	И ВСД_Продукция_Элемент.GUID = &GUID");
		Запрос.УстановитьПараметр("Название", Лев(productItemName, 150)); // ЖД до размера реквизита 1с8
		Запрос.УстановитьПараметр("GUID", productItemGuid ); // Обязательно пустой GUID
		
		Результат = Запрос.Выполнить().Выбрать();
	КонецЕсли;
	
	Если Результат.Следующий() Тогда
		
		СпрСсылка = Результат.Ссылка;
		Если Параметры.ЗаполнятьТермическиеУсловияИзВходящегоВСД И ТермическиеУсловияПеревозки <> Неопределено Тогда
			Если СпрСсылка.ТермическиеУсловияПеревозки <> ТермическиеУсловияПеревозки Тогда
				Спр = СпрСсылка.ПолучитьОбъект();
				Спр.ТермическиеУсловияПеревозки = ТермическиеУсловияПеревозки;
				Спр.Записать();
				СпрСсылка = Спр.Ссылка;
				ВетИС_APIСервер.СообщитьИнфо("Для продукции [" + productItemName + "] изменены термические условия на:" + ТермическиеУсловияПеревозки, СпрСсылка);
			КонецЕсли;
		КонецЕсли;
		Ответ = СпрСсылка;
		
	Иначе
		
		Спр = Справочники.ВСД_Продукция_Элемент.СоздатьЭлемент();
		Спр.Наименование = productItemName;
		Спр.guid = productItemGuid;
		Спр.Uuid = productItemUuid;
		
		Если ВидПроисхожденияНеПищевойПродукции <> Неопределено Тогда
			Спр.ВидПроисхожденияНеПищевойПродукции = ВидПроисхожденияНеПищевойПродукции;
		КонецЕсли;
		
		Если Параметры.ЗаполнятьТермическиеУсловияИзВходящегоВСД И ТермическиеУсловияПеревозки <> Неопределено Тогда
			Спр.ТермическиеУсловияПеревозки = ТермическиеУсловияПеревозки;
		Иначе
			Спр.ТермическиеУсловияПеревозки = Параметры["ТермическиеУсловияПеревозки"];
		КонецЕсли;
		
		Спр.Записать();
		ВетИС_APIСервер.СообщитьИнфо("не найден ВСД_Продукция_Элемент [" + productItemName + "] GUID [" + productItemGuid + "]. Создан новый элемент справочника", Спр.Ссылка);
		Если ОбновитьДанные Тогда
			Продукция_Элемент_Получить_Инфо(Параметры, спр.Ссылка);
		КонецЕсли;
		Ответ = спр.Ссылка;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Процедура Продукция_Элемент_Получить_Список_По_Площадке_ВФоне(Знач Параметры, АдресХранилища) Экспорт
	
	ВыбПлощадка = Параметры["ВыбПлощадка"];
	Если НЕ ЗначениеЗаполнено(ВыбПлощадка) Тогда
		ВетИС_APIСервер.СообщитьИнфо("Выберите Площадку Для получения продукции");
		Возврат;
	КонецЕсли;
	
	Ответ = Продукция_Элемент_ПолучитьСписокПоПлощадке(Параметры, ВыбПлощадка);
	РезультатОбработки = Новый Структура();
	Если Ответ Тогда
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Истина);
	Иначе
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Ложь);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатОбработки, АдресХранилища);
	
КонецПроцедуры

Функция Продукция_Элемент_Изменить_ЗапросXML(Параметры, ВыбПродукцияЭлемент, ВыбКоманда) Экспорт
	
	Запрос ="<SOAP-ENV:Envelope 
	|xmlns:dt='http://api.vetrf.ru/schema/cdm/dictionary/v2' 
	|xmlns:bs='http://api.vetrf.ru/schema/cdm/base' 
	|xmlns:merc='http://api.vetrf.ru/schema/cdm/mercury/g2b/applications/v2' 
	|xmlns:apldef='http://api.vetrf.ru/schema/cdm/application/ws-definitions' 
	|xmlns:apl='http://api.vetrf.ru/schema/cdm/application' 
	|xmlns:vd='http://api.vetrf.ru/schema/cdm/mercury/vet-document/v2' 
	|xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/'>
	|<SOAP-ENV:Header/>
	|<SOAP-ENV:Body>
	|<apldef:submitApplicationRequest>
	|<apldef:apiKey>" + СокрЛП(Параметры["param_api_key"]) + "</apldef:apiKey>
	|<apl:application>
	|<apl:serviceId>mercury-g2b.service:2.1</apl:serviceId>
	|<apl:issuerId>" + СокрЛП(Параметры["param_issuer_id"]) + "</apl:issuerId>
	|<apl:issueDate>" + ВетИС_APIСервер.ДатаXML(ТекущаяДата(), "T00:00:00") + "</apl:issueDate>
	|<apl:data>
	|<merc:modifyProducerStockListRequest>
	|<merc:localTransactionId>" + "Id1" + "</merc:localTransactionId>
	|<merc:initiator>
	|<vd:login>" + СокрЛП(Параметры["param_intiator_login"]) + "</vd:login>
	|</merc:initiator>
	|<merc:modificationOperation>
	|<vd:type>" + ВыбКоманда + "</vd:type>";
	Если ВыбКоманда = "DELETE" Тогда
		Запрос = Запрос + "
		|<vd:affectedList>
		|<dt:productItem>
		|<bs:uuid>" + СокрЛП(ВыбПродукцияЭлемент.UUID) + "</bs:uuid>
		|</dt:productItem>
		|</vd:affectedList>";
	Иначе
		Запрос = Запрос + "
		|<vd:resultingList>
		|<dt:productItem>";
		Если ЗначениеЗаполнено(ВыбПродукцияЭлемент.UUID) Тогда
			Запрос = Запрос + "
			|<bs:uuid>" + СокрЛП(ВыбПродукцияЭлемент.UUID) + "</bs:uuid>";
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыбПродукцияЭлемент.GTIN) Тогда
			Запрос = Запрос + "
			|<dt:globalID>" + СокрЛП(ВыбПродукцияЭлемент.GTIN) + "</dt:globalID>";
		КонецЕсли;
		
		Запрос = Запрос + "
		|<dt:name>" + ВетИС_APIСервер.ЗаменитьСпецСимволы(ВыбПродукцияЭлемент.Наименование) + "</dt:name>";
		Если ЗначениеЗаполнено(ВыбПродукцияЭлемент.Артикул) Тогда
			Запрос = Запрос + "
			|<dt:code>" + СокрЛП(ВыбПродукцияЭлемент.Артикул) + "</dt:code>";
		КонецЕсли;
		
		Запрос = Запрос + "
		|<dt:productType>" + ВыбПродукцияЭлемент.Продукция.Тип + "</dt:productType>
		|<dt:product>
		|<bs:guid>" + Сокрлп(ВыбПродукцияЭлемент.Продукция.GUID) + "</bs:guid>
		|</dt:product>
		|<dt:subProduct>
		|<bs:guid>" + Сокрлп(ВыбПродукцияЭлемент.ВидПродукции.GUID) + "</bs:guid>
		|</dt:subProduct>
		|<dt:correspondsToGost>" + ВетИС_APIСервер.НашеБулево(ВыбПродукцияЭлемент.СоответствуетГОСТу) + "</dt:correspondsToGost>";
		Если ВыбПродукцияЭлемент.СоответствуетГОСТу = 1 Тогда
			Запрос = Запрос + "
			|<dt:gost>" + СокрЛП(ВыбПродукцияЭлемент.Гост) + "</dt:gost>";
		КонецЕсли;
		
		// ХС Производитель И владелец ТМ
		Запрос = Запрос + "
		|<dt:producer>
		|<bs:guid>" + Сокрлп(Параметры["Отправитель_ХозСубъект"].GUID) + "</bs:guid>
		|</dt:producer>
		|<dt:tmOwner>
		|<bs:guid>" + Сокрлп(Параметры["Отправитель_ХозСубъект"].GUID) + "</bs:guid>
		|</dt:tmOwner>";
		
		Запрос = Запрос + "
		|<dt:producing>
		|<dt:location>
		|<bs:guid>" + Сокрлп(ВыбПродукцияЭлемент.Площадка.GUID) + "</bs:guid>
		|</dt:location>
		|</dt:producing>";
		
		// ЖД ФАСОВКА
		Если ЗначениеЗаполнено(ВыбПродукцияЭлемент.ФасовкаФормаУпаковки) И ЗначениеЗаполнено(ВыбПродукцияЭлемент.ФасовкаЕдиницаИзмерения) Тогда
			Запрос = Запрос + "
			|<dt:packaging>
			|<dt:packagingType>
			|<bs:guid>" + Сокрлп(ВыбПродукцияЭлемент.ФасовкаФормаУпаковки.GUID) + "</bs:guid>
			|</dt:packagingType>
			|<dt:quantity>" + ВыбПродукцияЭлемент.ФасовкаКоличество + "</dt:quantity>
			|<dt:volume>" + Формат(ВыбПродукцияЭлемент.ФасовкаОбъем, "ЧРД=.; ЧГ=0;ЧН=0") + "</dt:volume>
			|<dt:unit>
			|<bs:guid>" + Сокрлп(ВыбПродукцияЭлемент.ФасовкаЕдиницаИзмерения.GUID) + "</bs:guid>
			|</dt:unit>
			|</dt:packaging>";
		КонецЕсли;
		Запрос = Запрос + "
		|</dt:productItem>
		|</vd:resultingList>";
	КонецЕсли;
	Запрос = Запрос + "
	|</merc:modificationOperation>
	|</merc:modifyProducerStockListRequest>
	|</apl:data>
	|</apl:application>
	|</apldef:submitApplicationRequest>
	|</SOAP-ENV:Body>
	|</SOAP-ENV:Envelope>";
	
	Возврат Запрос;
	
КонецФункции

Функция Продукция_Элемент_Изменить(Знач Параметры, ВыбПродукцияЭлемент , ВыбКоманда) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВыбПродукцияЭлемент) Тогда
		ВетИС_APIСервер.СообщитьИнфо("Укажите Продукцию Для обработки в Меркурий");
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ(ЗначениеЗаполнено(ВыбПродукцияЭлемент.Площадка.GUID)) Тогда
		ВетИС_APIСервер.СообщитьИнфо("В продукцияЭлемент.Площадка пустой GUID");
		Возврат Ложь;
	КонецЕсли;
	
	Если (ВыбКоманда = "DELETE") И (Не (ЗначениеЗаполнено(ВыбПродукцияЭлемент.UUID))) Тогда
		ВетИС_APIСервер.СообщитьИнфо("Невозможно выполнить операцию удаления " + ВыбПродукцияЭлемент + " т.к. не указан ее UUID");
		Возврат Ложь;
	КонецЕсли;
	
	ЗапросXML = Продукция_Элемент_Изменить_ЗапросXML(Параметры, ВыбПродукцияЭлемент, ВыбКоманда);
	Service = "platform/services/2.1/ApplicationManagementService";
	Action = "submitApplicationRequest";
	
	ПараметрыОтправки = кб99_ВСД_Отправка.ПараметрыОтправкиИнициализация(Параметры);
	ПараметрыОтправки.ЗапросXML = ЗапросXML;
	ПараметрыОтправки.Service = Service;
	ПараметрыОтправки.Action = Action;
	xdto = кб99_ВСД_Отправка.ОтправитьSOAPНаСервере(ПараметрыОтправки);
	
	Если ВетИС_APIСервер.НайтиОшибки(xdto, ВыбПродукцияЭлемент) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	appID = кб99_ВСД_Отправка.Получить_ApplicationID(xdto);
	
	Ответ = Продукция_Элемент_Изменить_ПолучитьОтвет(Параметры, ВыбПродукцияЭлемент, appID);
	
	Возврат Ответ;
	
КонецФункции

Процедура Продукция_Элемент_Изменить_ВФоне(Знач Параметры, АдресХранилища) Экспорт
	
	Выб_ВСД_Продукция_Элемент = Параметры["Выб_ВСД_Продукция_Элемент"];
	Если НЕ ЗначениеЗаполнено(Выб_ВСД_Продукция_Элемент) Тогда
		ВетИС_APIСервер.СообщитьИнфо("Выберите ВСД_Продукция_Элемент ");
		Возврат;
	КонецЕсли;
	ВыбКоманда = Параметры["ВыбКоманда"];
	
	Ответ = Продукция_Элемент_Изменить(Параметры, Выб_ВСД_Продукция_Элемент, ВыбКоманда);
	РезультатОбработки = Новый Структура();
	Если Ответ Тогда
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Истина);
	Иначе
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Ложь);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатОбработки, АдресХранилища);
	
КонецПроцедуры

Функция Продукция_Элемент_Изменить_ПолучитьОтвет(Параметры, ВыбПродукцияЭлемент, appID) Экспорт
	
	Если ПустаяСтрока(appID) Тогда
		ВетИС_APIСервер.СообщитьИнфо("Пустая ссылка applicationID");
		Возврат Ложь;
	КонецЕсли;
	
	ВетИС_APIСервер.Пауза(Параметры["ПаузаСек"]);
	
	xdto = кб99_ВСД_Отправка.ПолучитьРезультатСервер(Параметры, appID);
	
	Если ВетИС_APIСервер.НайтиОшибки(xdto, ВыбПродукцияЭлемент) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Статус = ВетИС_APIСервер.СтатусЗапроса(xdto);
	//Если Статус = "IN_PROCESS" Тогда
	Если Статус = Перечисления.кб99_СтатусЗапроса.IN_PROCESS Тогда
		Продукция_Элемент_Изменить_ПолучитьОтвет(Параметры, ВыбПродукцияЭлемент, appID);
	Иначе
		Ответ = ПолучитьРезультат_Список_Продукции(Параметры, xdto, ВыбПродукцияЭлемент, Неопределено);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция Продукция_Элемент_ПолучитьСписокПоПлощадке_ЗапросXML(Площадка, Параметры) Экспорт
	
	Запрос = "<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/'
	|xmlns:ws='http://api.vetrf.ru/schema/cdm/registry/ws-definitions/v2'
	|xmlns:bs='http://api.vetrf.ru/schema/cdm/base'
	|xmlns:dt='http://api.vetrf.ru/schema/cdm/dictionary/v2'>
	|<soapenv:Header/>
	|<soapenv:Body>
	|<ws:getProductItemListRequest>
	|<bs:listOptions>
	|<bs:count>1000</bs:count>
	|<bs:offset>" + Формат(Параметры["Смещение"], "ЧДЦ=0; ЧН=0; ЧГ=" ) + "</bs:offset>
	|</bs:listOptions>
	|<dt:enterprise>
	|<bs:guid>" + СокрЛП(Площадка.GUID) + "</bs:guid>
	|</dt:enterprise>
	|</ws:getProductItemListRequest>
	|</soapenv:Body>
	|</soapenv:Envelope>	
	|";
	
	Возврат Запрос;
	
КонецФункции

Функция Продукция_Элемент_ПолучитьСписокПоПлощадке(Знач Параметры, Площадка) Экспорт
	
	ЗапросXML = Продукция_Элемент_ПолучитьСписокПоПлощадке_ЗапросXML(Площадка, Параметры);
	Service = "platform/services/2.1/ProductService";
	Action = "GetProductItemList";
	ПараметрыОтправки = кб99_ВСД_Отправка.ПараметрыОтправкиИнициализация(Параметры);
	ПараметрыОтправки.ЗапросXML = ЗапросXML;
	ПараметрыОтправки.Service = Service;
	ПараметрыОтправки.Action = Action;
	xdto = кб99_ВСД_Отправка.ОтправитьSOAPНаСервере(ПараметрыОтправки);
	
	Если ВетИС_APIСервер.НайтиОшибки(xdto, Площадка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Ответ = ПолучитьРезультат_Список_Продукции(Параметры, xdto, , Площадка);
	
	Возврат Ответ;
	
КонецФункции

Функция ЗагрузитьЕдиницыИзмерения_ЗапросXML() Экспорт
	
	Запрос = "
	|<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/' 
	|xmlns:ws='http://api.vetrf.ru/schema/cdm/registry/ws-definitions/v2' 
	|xmlns:bs='http://api.vetrf.ru/schema/cdm/base'>
	|   <soapenv:Header/>
	|   <soapenv:Body>
	|      <ws:getUnitListRequest>
	|         <bs:listOptions>
	|            <bs:count>1000</bs:count>
	|            <bs:offset>0</bs:offset>
	|         </bs:listOptions>
	|      </ws:getUnitListRequest>
	|   </soapenv:Body>
	|</soapenv:Envelope>
	|";
	
	Возврат Запрос;
	
КонецФункции

Процедура ИнициализацияХС_ЗагрузитьЕдиницыИзмерения_ВФоне(Знач Параметры, АдресХранилища) Экспорт
	
	Ответ = ИнициализацияХС_ЗагрузитьЕдиницыИзмерения(Параметры);
	
	РезультатОбработки = Новый Структура();
	Если Ответ Тогда
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Истина);
	Иначе
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Ложь);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатОбработки, АдресХранилища);
	
КонецПроцедуры

Функция ИнициализацияХС_ЗагрузитьЕдиницыИзмерения(Знач Параметры) Экспорт
	
	ВетИС_APIСервер.ПометитьНаУдалениеСправочник("ВСД_ЕдиницыИзмерения");
	
	ВетИС_APIСервер.СообщитьИнфо(" Запрос GetUnitList ");
	ЗапросXML = ЗагрузитьЕдиницыИзмерения_ЗапросXML();
	Service = "platform/services/2.1/DictionaryService";
	Action = "GetUnitList";
	
	ПараметрыОтправки = кб99_ВСД_Отправка.ПараметрыОтправкиИнициализация(Параметры);
	ПараметрыОтправки.ЗапросXML = ЗапросXML;
	ПараметрыОтправки.Service = Service;
	ПараметрыОтправки.Action = Action;
	
	xdto = кб99_ВСД_Отправка.ОтправитьSOAPНаСервере(ПараметрыОтправки);
	
	Ответ = Ложь;
	
	// НачатьТранзакцию();
	Попытка
		unitList = xdto.Body.getUnitListResponse.UnitList.Unit;
		
		Для каждого unit ИЗ unitList Цикл
			
			guid = unit.guid;
			_uuid = unit.uuid;
			name = unit.name;
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	ВСД_ЕдиницыИзмерения.Ссылка
			|ИЗ
			|	Справочник.ВСД_ЕдиницыИзмерения КАК ВСД_ЕдиницыИзмерения
			|ГДЕ
			|	ВСД_ЕдиницыИзмерения.GUID = &GUID");
			Запрос.УстановитьПараметр("GUID", guid);
			
			Результат = Запрос.Выполнить().Выбрать();
			
			Если Результат.Следующий() Тогда
				Ответ = Результат.Ссылка;
				Спр = Результат.Ссылка.ПолучитьОбъект();
				Спр.УстановитьПометкуУдаления(Ложь);
				ВетИС_APIСервер.СообщитьИнфо("ВСД_ЕдиницыИзмерения [" + name + "] GUID [" + guid + "] обновлена");
			Иначе
				ВетИС_APIСервер.СообщитьИнфо("ВСД_ЕдиницыИзмерения [" + name + "] GUID [" + guid + "] добавлена");
				Спр = Справочники.ВСД_ЕдиницыИзмерения.СоздатьЭлемент();
			КонецЕсли;
			
			Спр.Наименование = name;
			Спр.GUID = guid;
			Спр.UUID = _UUID;
			Спр.Коэффициент = unit.factor;
			Спр.Записать();
			Ответ = Спр.Ссылка;
			
		КонецЦикла;
		
		//ЗафиксироватьТранзакцию();
		Ответ = Истина;
		ВетИС_APIСервер.СообщитьИнфо("Загрузка ВСД_ЕдиницыИзмерения завершена");
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при получении ВСД_ЕдиницыИзмерения'"),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		//ОтменитьТранзакцию();
		
		Ответ = Ложь;
		ВетИС_APIСервер.СообщитьИнфо("Ошибка при получении ВСД_ЕдиницыИзмерения " + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция НайтиЕдИзмерения(guid, _uuid = "") Экспорт
	
	Если ПустаяСтрока(guid) = 0 Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ВСД_ЕдиницыИзмерения.Ссылка
		|ИЗ
		|	Справочник.ВСД_ЕдиницыИзмерения КАК ВСД_ЕдиницыИзмерения
		|ГДЕ
		|	ВСД_ЕдиницыИзмерения.GUID = &GUID");
		Запрос.УстановитьПараметр("GUID", Guid);
		
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			Ответ = Результат.Ссылка;
		Иначе
			ВетИС_APIСервер.СообщитьИнфо("ВСД_ЕдиницыИзмерения Guid " + guid + " не найдена. Выполните инициализацию");
			Ответ = Справочники.ВСД_ЕдиницыИзмерения.ПустаяСсылка();
		КонецЕсли;
	Иначе
		ВетИС_APIСервер.СообщитьИнфо("Пустой Guid ВСД_ЕдиницыИзмерения");
		Ответ = "";
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ИнициализацияХС_ЗагрузитьЦели_ЗапросXML() Экспорт
	
	Запрос = "
	|<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/' 
	|xmlns:ws='http://api.vetrf.ru/schema/cdm/registry/ws-definitions/v2' 
	|xmlns:bs='http://api.vetrf.ru/schema/cdm/base'>
	|   <soapenv:Header/>
	|   <soapenv:Body>
	|      <ws:getPurposeListRequest>
	|         <bs:listOptions>
	|            <bs:count>1000</bs:count>
	|            <bs:offset>0</bs:offset>
	|         </bs:listOptions>    
	|      </ws:getPurposeListRequest>
	|   </soapenv:Body>
	|</soapenv:Envelope>
	|";
	
	Возврат Запрос;
	
КонецФункции

Процедура ИнициализацияХС_ЗагрузитьЦели_ВФоне(Знач Параметры, АдресХранилища) Экспорт
	
	Ответ = ИнициализацияХС_ЗагрузитьЦели(Параметры);
	
	РезультатОбработки = Новый Структура();
	Если Ответ Тогда
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Истина);
	Иначе
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Ложь);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатОбработки, АдресХранилища);
	
КонецПроцедуры 

Функция ИнициализацияХС_ЗагрузитьЦели(Знач Параметры) Экспорт
	
	ВетИС_APIСервер.ПометитьНаУдалениеСправочник("ВСД_Цель");
	
	ЗапросXML = ИнициализацияХС_ЗагрузитьЦели_ЗапросXML();
	Service = "platform/services/2.1/DictionaryService";
	Action = "GetPurposeList";
	ПараметрыОтправки = кб99_ВСД_Отправка.ПараметрыОтправкиИнициализация(Параметры);
	ПараметрыОтправки.ЗапросXML = ЗапросXML;
	ПараметрыОтправки.Service = Service;
	ПараметрыОтправки.Action = Action;
	
	ВетИС_APIСервер.СообщитьИнфо("Отправляем запрос GetPurposeList");
	xdto = кб99_ВСД_Отправка.ОтправитьSOAPНаСервере(ПараметрыОтправки);
	
	// НачатьТранзакцию();
	Попытка
		List = xdto.Body.getPurposeListResponse.purposeList.purpose;
		Для каждого item ИЗ List Цикл
			_uuid = item.uuid;
			guid = item.guid;
			name = item.name;
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	ВСД_Цель.Ссылка
			|ИЗ
			|	Справочник.ВСД_Цель КАК ВСД_Цель
			|ГДЕ
			|	ВСД_Цель.GUID = &GUID");
			Запрос.УстановитьПараметр("GUID", guid);
			
			Результат = Запрос.Выполнить().Выбрать();
			
			Если Результат.Следующий() Тогда
				Ответ = Результат.Ссылка;
				Спр = Результат.Ссылка.ПолучитьОбъект();
				Спр.УстановитьПометкуУдаления(Ложь);
				ВетИС_APIСервер.СообщитьИнфо("ВСД_Цель [" + name + "] GUID [" + guid + "] обновлена");
			Иначе
				ВетИС_APIСервер.СообщитьИнфо("ВСД_Цель [" + name + "] GUID [" + guid + "] добавлена");
				Спр = Справочники.ВСД_Цель.СоздатьЭлемент();
			КонецЕсли;
			
			Спр.Наименование = name;
			Спр.GUID = guid;
			Спр.UUID = _UUID;
			Спр.Записать();
			Ответ = Спр.Ссылка;
			ВетИС_APIСервер.СообщитьИнфо("Записан ВСД_Цель [" + name + "] ");
		КонецЦикла;
		//ЗафиксироватьТранзакцию();
		Ответ = Истина;
		ВетИС_APIСервер.СообщитьИнфо("ВСД_Цель загрузка завершена");
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при получении ВСД_Цель'"),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		//ОтменитьТранзакцию();
		Ответ = Ложь;
		
		ВетИС_APIСервер.СообщитьИнфо("Ошибка при получении ВСД_Цель");
		ВетИС_APIСервер.СообщитьИнфо(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция НайтиФормуУпаковки(guid, name, _uuid = "", КодУпаковки = "") Экспорт
	
	Ответ = "";
	Guid = СокрЛП(Guid);
	Если ПустаяСтрока(Guid) = 0 Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ВСД_ФормыУпаковки.Ссылка
		|ИЗ
		|	Справочник.ВСД_ФормыУпаковки КАК ВСД_ФормыУпаковки
		|ГДЕ
		|	ВСД_ФормыУпаковки.GUID = &GUID");
		Запрос.УстановитьПараметр("GUID", Guid);
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда
			Ответ = Результат.Ссылка;
			Если НЕ (Ответ.Наименование = name) Тогда
				ВетИС_APIСервер.СообщитьИнфо("ВСД_ФормыУпаковки " + Ответ.Наименование + " изменилось Наименование на [" + name + "] перезаписано");
				текСпр = Ответ.ПолучитьОбъект();
				текСпр.Наименование = name;
				текСпр.Записать();
				Ответ = текСпр.Ссылка;
			КонецЕсли;
			СпрОбъект = Ответ.ПолучитьОбъект();
			СпрОбъект.УстановитьПометкуУдаления(Ложь);
		Иначе
			ВетИС_APIСервер.СообщитьИнфо("ВСД_ФормыУпаковки GUID [" + guid + "] добавлена");
			Спр = Справочники.ВСД_ФормыУпаковки.СоздатьЭлемент();
			Спр.Наименование = name;
			Спр.GUID = guid;
			Спр.UUID = _uuid;
			Попытка Спр.КодУпаковки = КодУпаковки;
			Исключение
			КонецПопытки;
			Спр.Записать();
			Ответ = Спр.Ссылка;
		КонецЕсли;
	Иначе
		ВетИС_APIСервер.СообщитьИнфо("Пустой Guid ВСД_ФормыУпаковки");
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Процедура ЗаполнитьФормыУпаковки(Знач Параметры, АдресХранилища) Экспорт
	
	// http://help.vetrf.ru/wiki/PackingForm
	
	//НачатьТранзакцию();
	
	ВетИС_APIСервер.ПометитьНаУдалениеСправочник("ВСД_ФормыУпаковки");
	
	Попытка
		// Соответствие между старым справочником упаковок И новым классификатором. 
		НайтиФормуУпаковки("fedf3e32-053c-11e1-99b4-d8d385fbc9e8", "Упаковка не определена");
		НайтиФормуУпаковки("fedf401c-053c-11e1-99b4-d8d385fbc9e8", "Мешок большой");
		НайтиФормуУпаковки("fedf412a-053c-11e1-99b4-d8d385fbc9e8", "Бочка");
		НайтиФормуУпаковки("fedf422e-053c-11e1-99b4-d8d385fbc9e8", "Банка, жестяная (консервная)");
		НайтиФормуУпаковки("fedf4328-053c-11e1-99b4-d8d385fbc9e8", "Коробка, картонная");
		НайтиФормуУпаковки("fedf4422-053c-11e1-99b4-d8d385fbc9e8", "Мешок бумажный многослойный");
		НайтиФормуУпаковки("fedf451c-053c-11e1-99b4-d8d385fbc9e8", "Мешок");
		НайтиФормуУпаковки("fedf4616-053c-11e1-99b4-d8d385fbc9e8", "Мешок ИЗ полимерной ткани");
		НайтиФормуУпаковки("fedf46fc-053c-11e1-99b4-d8d385fbc9e8", "Неупакованный ИЛИ нерасфасованный");
		НайтиФормуУпаковки("fedf47ec-053c-11e1-99b4-d8d385fbc9e8", "Упаковка не определена");
		НайтиФормуУпаковки("fedf48dc-053c-11e1-99b4-d8d385fbc9e8", "Пакет");
		НайтиФормуУпаковки("fedf49cc-053c-11e1-99b4-d8d385fbc9e8", "Упаковка не определена");
		НайтиФормуУпаковки("fedf55e8-053c-11e1-99b4-d8d385fbc9e8", "Коробка, пенопластовая");
		НайтиФормуУпаковки("fedf56f6-053c-11e1-99b4-d8d385fbc9e8", "Поддон");
		НайтиФормуУпаковки("fedf57f0-053c-11e1-99b4-d8d385fbc9e8", "Упаковка не определена");
		НайтиФормуУпаковки("fedf58e0-053c-11e1-99b4-d8d385fbc9e8", "Упаковка не определена");
		НайтиФормуУпаковки("fedf59da-053c-11e1-99b4-d8d385fbc9e8", "Упаковка не определена");
		НайтиФормуУпаковки("fedf5ad4-053c-11e1-99b4-d8d385fbc9e8", "Коробка");
		НайтиФормуУпаковки("fedf5bc4-053c-11e1-99b4-d8d385fbc9e8", "Упаковка не определена");
		НайтиФормуУпаковки("fedf5cb4-053c-11e1-99b4-d8d385fbc9e8", "Корзина");
		НайтиФормуУпаковки("fedf5d9a-053c-11e1-99b4-d8d385fbc9e8", "Цистерна контейнер универсальный");
		НайтиФормуУпаковки("fedf5e80-053c-11e1-99b4-d8d385fbc9e8", "Мешок, бумажный");
		НайтиФормуУпаковки("fedf5f70-053c-11e1-99b4-d8d385fbc9e8", "Коробка, пенопластовая");
		НайтиФормуУпаковки("fedf606a-053c-11e1-99b4-d8d385fbc9e8", "Контейнер средней грузоподъемности Для массовых грузов");
		НайтиФормуУпаковки("fedf615a-053c-11e1-99b4-d8d385fbc9e8", "Поддон");
		НайтиФормуУпаковки("fedf6240-053c-11e1-99b4-d8d385fbc9e8", "Крюк");
		НайтиФормуУпаковки("fedf6344-053c-11e1-99b4-d8d385fbc9e8", "Упаковка не определена");
		НайтиФормуУпаковки("a99ecd22-d2e8-11e4-8109-d89d67148660", "Упаковка не определена");
		НайтиФормуУпаковки("dae4571f-d2e8-11e4-8109-d89d67148660", "Коробка, пластмассовая");
		
		// Новый классификатор упаковок
		
		НайтиФормуУпаковки("5ad138ef-2493-4117-bf83-b76e4e5f609d", "Ампула, защищенная");
		НайтиФормуУпаковки("1f9a9273-be63-4e4b-b29b-dfee1f0da370", "Ампула, незащищенная");
		НайтиФормуУпаковки("975160ee-6cb0-4501-a821-9e3574f09446", "Аэрозольная упаковка");
		НайтиФормуУпаковки("ec29a5a8-17fa-480c-a1d5-333a4411e393", "Багаж");
		НайтиФормуУпаковки("0f4cc0b5-af48-4571-a06b-96504ec89012", "Бадья");
		НайтиФормуУпаковки("93bdc740-0f32-4019-a3fd-ed661f2bc3b9", "Бак");
		НайтиФормуУпаковки("bc29f22a-6086-4438-acd2-1f40a3b00a66", "Балка");
		НайтиФормуУпаковки("491e8863-7850-4b06-8abc-52c09dd05d0d", "Балка в пакете/пачке/связке");
		НайтиФормуУпаковки("6a10e7ae-b8ff-4249-a23d-1dec8128c4a1", "Баллон, газовый");
		НайтиФормуУпаковки("0fdf7f98-6595-480b-8988-5544d8ff40b3", "Баллон, защищенный");
		НайтиФормуУпаковки("49e8e70e-e539-4ce1-8d20-5a49ae276f77", "Баллон, незащищенный");
		НайтиФормуУпаковки("8a9c1190-aeeb-498d-8e80-5ddfbc3f7df2", "Бандероль");
		НайтиФормуУпаковки("0cc66f67-3111-4e77-9dcc-c9a9df725bed", "Банка (емкостью менее 5 л) жестяная прямоугольная");
		НайтиФормуУпаковки("18a67ab0-21a3-4e8c-9058-d8f42820938d", "Банка (емкостью менее 5 л) жестяная с ручкой И выпускным отверстием");
		НайтиФормуУпаковки("54ed0793-c32e-41c1-9321-608c1a224edc", "Банка (емкостью менее 5 л) жестяная цилиндрическая");
		НайтиФормуУпаковки("91f360ff-5731-4c1c-bf11-7ea3d6d1a3ca", "Банка жестяная Для сухих продуктов (массой до 2,2 кг)");
		НайтиФормуУпаковки("c1f40234-bff1-42c8-8e19-d6cad7f00fce", "Банка широкогорлая (емкостью около 4,5 литров)");
		НайтиФормуУпаковки("fedf422e-053c-11e1-99b4-d8d385fbc9e8", "Банка, жестяная (консервная)");
		НайтиФормуУпаковки("13f13e66-adf4-431a-9cff-22cfd839047b", "Барабан");
		НайтиФормуУпаковки("2e53354c-4023-434b-926f-bbdd1af00a37", "Барабан алюминиевый с несъемным днищем");
		НайтиФормуУпаковки("970e40fd-3436-48ed-ac99-e78802f57119", "Барабан алюминиевый со съемным днищем");
		НайтиФормуУпаковки("eec09740-2c4c-460b-94ed-c4d4ef437f1b", "Барабан пластмассовый с несъемным днищем");
		НайтиФормуУпаковки("d565dd82-5fc1-4303-a55d-495c35ac22ec", "Барабан пластмассовый со съемным днищем");
		НайтиФормуУпаковки("02f1c682-8f53-47f8-b8dc-72404d986e66", "Барабан стальной");
		НайтиФормуУпаковки("c113fb0c-23eb-4ce5-ad44-8250598f173e", "Барабан стальной с несъемным днищем");
		НайтиФормуУпаковки("1852b14d-39a0-4712-9e55-90a7005d5469", "Барабан стальной со съемным днищем");
		НайтиФормуУпаковки("e5f7f98d-6a9c-4866-8cac-4819f71e41b3", "Барабан фанерный");
		НайтиФормуУпаковки("6bf25be3-0cf7-4dd8-a383-049a02862968", "Барабан фибровый");
		НайтиФормуУпаковки("ed90911b-d130-4d3b-ae0b-2f0754d23fd4", "Барабан, алюминиевый");
		НайтиФормуУпаковки("0ef53349-5258-4efc-ac2a-23d1e33f387b", "Барабан, деревянный");
		НайтиФормуУпаковки("bbe136bd-0da4-42fd-800a-79435f4dd2c0", "Барабан, железный");
		НайтиФормуУпаковки("dd7c7ba0-dbc3-435d-94f7-5b758ca36898", "Барабан, пластмассовый");
		НайтиФормуУпаковки("ae0b5e58-8771-48f7-8c3c-11dfdb17ebad", "Без клети");
		НайтиФормуУпаковки("34e245a7-cd7c-4d8b-a436-482dcbcf1f38", "Бидон");
		НайтиФормуУпаковки("41e9ff79-b6c4-46e7-a2d4-6f5bf3ee1002", "Бобина");
		НайтиФормуУпаковки("fedf412a-053c-11e1-99b4-d8d385fbc9e8", "Бочка");
		НайтиФормуУпаковки("3630beae-fe03-49ff-9264-93925ca7ce80", "Бочка (емкостью около 164 л)");
		НайтиФормуУпаковки("5623e14a-903b-48e4-8afa-07db65991173", "Бочка (емкостью около 164 л) деревянная");
		НайтиФормуУпаковки("3c78e2e1-d19a-40d3-b970-4fe6d2b722d0", "Бочка (емкостью около 164 л) деревянная со съемным днищем");
		НайтиФормуУпаковки("021bc2d9-f514-4491-b21a-ffe63023236f", "Бочка (емкостью около 164 л) деревянная шпунтованная");
		НайтиФормуУпаковки("37495e99-e19f-4221-97e8-39565c0192b8", "Бочка деревянная (емкостью около 200 л)");
		НайтиФормуУпаковки("c8066a6e-5f19-4429-85e1-9b2df548afa1", "Бочка Для вина ИЛИ пива");
		НайтиФормуУпаковки("f1d48fb7-8536-4b99-8668-bd6a55167306", "Бочка Для вина ИЛИ пива большая (емкостью около 1146 л) (тан)");
		НайтиФормуУпаковки("6583f8bf-8317-4ba4-bf4b-fafcd1d13bc1", "Бочка емкостью 238 л (хогсхед)");
		НайтиФормуУпаковки("8915e7eb-4f39-48aa-8171-7a629c95b69e", "Бочонок (емкостью около 41 л)");
		НайтиФормуУпаковки("8fe0727a-b2ed-4040-9df5-a14e4ad7f6a8", "Бочонок (емкостью около 46 л)");
		НайтиФормуУпаковки("07f35ce7-6d5a-49e7-a7e2-659b6cf74def", "Бревно");
		НайтиФормуУпаковки("0e0ccdf4-8779-4d65-84e2-d9e689314630", "Бревно в пакете/пачке/связке");
		НайтиФормуУпаковки("d9afec35-b224-404f-a3ff-74a0496c128d", "Брезент");
		НайтиФормуУпаковки("0ed01082-9c8e-49fa-8ba4-a91879d4b192", "Брус (брусок)");
		НайтиФормуУпаковки("086a3064-ab16-4d38-a7fa-3a28ee66b58b", "Брус (брусок) в пакете/пачке/связке");
		НайтиФормуУпаковки("d2ed24d1-c72a-4dc6-b3a8-ff8ca179c5c4", "Бункер");
		НайтиФормуУпаковки("a23634f3-9e71-4c80-abc5-e4c77ac70c88", "Бутылка оплетенная");
		НайтиФормуУпаковки("f7183d0a-5cee-4de8-9d08-bd5c7512ea7c", "Бутылка с выпуклыми стенками защищенная");
		НайтиФормуУпаковки("883a32f4-984e-43c1-8e03-ad02929cbfe4", "Бутылка с выпуклыми стенками незащищенная");
		НайтиФормуУпаковки("9adfe441-f411-4fcc-9568-8274ec2a0697", "Бутылка цилиндрическая защищенная");
		НайтиФормуУпаковки("1b986c7e-dcff-452f-b9c5-bc47afa6ccdc", "Бутылка цилиндрическая незащищенная");
		НайтиФормуУпаковки("3e311a74-00dd-4554-b656-748aa45cc069", "Бутыль оплетенная большая (емкостью от 9 до 54 л) защищенная");
		НайтиФормуУпаковки("b654b00e-7601-408e-b059-783ab0371b35", "Бутыль оплетенная большая (емкостью от 9 до 54 л) незащищенная");
		НайтиФормуУпаковки("fc881dea-5868-43ea-8b84-768aad44bc39", "Бутыль оплетенная защищенная");
		НайтиФормуУпаковки("f8552b0c-1de2-4509-8de9-06284d01bdff", "Бутыль оплетенная незащищенная");
		НайтиФормуУпаковки("87cff419-7bd1-4a2a-b52e-3f6c358138c8", "Бухта");
		НайтиФормуУпаковки("04735711-516d-4331-92c6-b55e5f8e3710", "В вакуумной упаковке");
		НайтиФормуУпаковки("b49dbb7b-56b9-48e3-9fd3-74a328dbcea3", "В термоусадочной пленке");
		НайтиФормуУпаковки("165fd412-0bfa-4bb5-8993-bcfaa5d82e1b", "Ведро");
		НайтиФормуУпаковки("657fad4d-71a4-4939-90a4-3fb0c9aea7f7", "Гильза");
		НайтиФормуУпаковки("a423d25a-2a14-40b8-bf13-f6a85b8fc887", "Гнездо (ячейка)");
		НайтиФормуУпаковки("4a7ea673-c3ac-40b5-836f-cfdd066b8020", "Горшок");
		НайтиФормуУпаковки("668e236b-70b0-4afc-8ab3-3fb9335f909e", "Грейферный ковш");
		НайтиФормуУпаковки("17f78e53-8978-4b58-9be5-d919c049a239", "Гроб");
		НайтиФормуУпаковки("d2612f44-ca2a-4146-986d-6650e6fe9194", "Грузовая партия (лот)");
		НайтиФормуУпаковки("af4d4677-3ea7-46ba-9fe0-504ba81ebea7", "Дозатор");
		НайтиФормуУпаковки("b8d3ee58-c120-4c4e-bd31-0e1d3451f5de", "Доска");
		НайтиФормуУпаковки("c84cb473-a0cc-4433-8b56-c7beb88fc59b", "Доска в пакете/пачке/связке");
		НайтиФормуУпаковки("3dca7c38-3a10-4fb6-9c1f-0c64ab79d63b", "Доска толстая в пакете/пачке/связке");
		НайтиФормуУпаковки("4d5772a0-9fa4-47ab-8c32-9a07729740ad", "Доска, толстая");
		НайтиФормуУпаковки("5e5f4afb-d5f8-483a-999e-cb985af7580b", "Единица");
		НайтиФормуУпаковки("207dccd8-7a12-44c3-a77b-7dd945a7b0bd", "Кадка");
		НайтиФормуУпаковки("6046383e-9e59-40bc-a70b-a0538ef536ca", "Кадка с крышкой");
		НайтиФормуУпаковки("4d9bd778-5ce4-411c-8d78-a1959ac55590", "Канистра пластмассовая с несъемным днищем");
		НайтиФормуУпаковки("ba61904f-f946-448a-958b-518655d8f567", "Канистра пластмассовая со съемным днищем");
		НайтиФормуУпаковки("a2110164-70b4-49f6-afaa-f3abde1be0f1", "Канистра стальная с несъемным днищем");
		НайтиФормуУпаковки("72896fbf-b156-4c7b-868d-ac13c5a85c7e", "Канистра стальная со съемным днищем");
		НайтиФормуУпаковки("12829e8e-7983-4745-8d01-5425d0244df6", "Канистра, пластмассовая");
		НайтиФормуУпаковки("a17e05ea-2fd6-485f-8db6-5aed1606f851", "Канистра, прямоугольная");
		НайтиФормуУпаковки("315646b0-01b2-4728-ab20-39911b080c26", "Канистра, стальная");
		НайтиФормуУпаковки("a7eb10cf-5a71-4cd2-97eb-c7369a407ccf", "Канистра, цилиндрическая");
		НайтиФормуУпаковки("8bcdee71-cca5-4536-ae2e-8a423d7dab60", "Капсула");
		НайтиФормуУпаковки("0f402761-1d53-45dc-9566-d709cd1ccb4d", "Кардная лента");
		НайтиФормуУпаковки("8211a6d5-11ea-4a5e-96dd-b52c3fe0a801", "Кассета");
		НайтиФормуУпаковки("c7ee807d-56a9-47c5-95d7-72021f303167", "Кассета с пленкой (фильмпак)");
		НайтиФормуУпаковки("4b3478b2-bd43-4fe1-85bd-77a457a1cd72", "Катушка");
		НайтиФормуУпаковки("31ff0ebc-8b93-4ab4-9e6f-04dcab641eb2", "Кипа, неспрессованная");
		НайтиФормуУпаковки("90ae449d-76c3-47a2-a0ec-39febdc0c965", "Кипа, спрессованная");
		НайтиФормуУпаковки("6da6c216-abc1-4534-825c-821a41b2dbc2", "Клеть");
		НайтиФормуУпаковки("09f4ec10-6101-4c3d-b57a-251aa11e7752", "Клеть (многооборотная) Общего фонда транспортировочного оборудования EC");
		НайтиФормуУпаковки("4770cd27-c22b-4da6-bba5-c69dcd601b74", "Клеть, роликовая");
		НайтиФормуУпаковки("538f0705-e05d-4154-bfb5-0e63ab30122b", "Кольцо");
		НайтиФормуУпаковки("d0416c04-368d-48bf-b5fb-d3fe21f3977c", "Комбинированная упаковка: пластмассовый сосуд");
		НайтиФормуУпаковки("858efe47-f7d6-4f6e-9408-79b8e3d9ae83", "Комбинированная упаковка: пластмассовый сосуд в барабане алюминиевом");
		НайтиФормуУпаковки("b95eb3b6-d08a-441e-9a3a-6d3f9501cc99", "Комбинированная упаковка: пластмассовый сосуд в барабане пластмассовом");
		НайтиФормуУпаковки("6b8efc02-9611-451c-b215-503bc29301cd", "Комбинированная упаковка: пластмассовый сосуд в барабане стальном");
		НайтиФормуУпаковки("21246938-dd6f-49aa-8e2a-d1cb13b0be17", "Комбинированная упаковка: пластмассовый сосуд в барабане фибровом");
		НайтиФормуУпаковки("05e4976b-9504-44ac-8645-06bf6a24ad59", "Комбинированная упаковка: пластмассовый сосуд в деревянной коробке");
		НайтиФормуУпаковки("5e8755cb-a874-499d-bb4d-34e465df0978", "Комбинированная упаковка: пластмассовый сосуд в коробке ИЗ твердой пластмассы");
		НайтиФормуУпаковки("eb55f088-06cc-4bab-9f84-49f2f999f428", "Комбинированная упаковка: пластмассовый сосуд в коробке ИЗ фибрового картона");
		НайтиФормуУпаковки("ab579955-759f-4de1-b8b9-460ad80facfb", "Комбинированная упаковка: пластмассовый сосуд в коробке фанерной");
		НайтиФормуУпаковки("95307257-321c-4dd1-9a30-e30cbcffcfb1", "Комбинированная упаковка: пластмассовый сосуд в ящике решетчатом (ИЛИ обрешетке) ИЗ алюминия");
		НайтиФормуУпаковки("43c6ad00-832f-42c6-8e2a-fe2273814b66", "Комбинированная упаковка: пластмассовый сосуд в ящике решетчатом (ИЛИ обрешетке) ИЗ стали");
		НайтиФормуУпаковки("380c561e-749a-4408-88de-ad5399c8a53f", "Комбинированная упаковка: стеклянный сосуд");
		НайтиФормуУпаковки("2e460cc7-7c38-4bf4-aa19-7768cb14d234", "Комбинированная упаковка: стеклянный сосуд в барабане алюминиевом");
		НайтиФормуУпаковки("fa1d17e8-e12d-4544-9461-db80f49cfe4b", "Комбинированная упаковка: стеклянный сосуд в барабане фанерном");
		НайтиФормуУпаковки("40c8a0db-74c9-4190-9449-6f3f8ac2eaa7", "Комбинированная упаковка: стеклянный сосуд в барабане фибровом");
		НайтиФормуУпаковки("32936c38-e9fa-439b-8108-5b7e3c482f6c", "Комбинированная упаковка: стеклянный сосуд в корзине плетеной с крышкой");
		НайтиФормуУпаковки("4195a944-7c45-44e9-9cf9-d366386ad86e", "Комбинированная упаковка: стеклянный сосуд в коробке деревянной");
		НайтиФормуУпаковки("eabbfb7f-b3ea-4858-981a-201a18be8a0a", "Комбинированная упаковка: стеклянный сосуд в коробке ИЗ фибрового картона");
		НайтиФормуУпаковки("5a349e4c-ce4c-485e-81db-beec4aa09fa4", "Комбинированная упаковка: стеклянный сосуд в пакете ИЗ твердой пластмассы");
		НайтиФормуУпаковки("ce9f36bf-2f90-424c-b34f-e8715dd15e02", "Комбинированная упаковка: стеклянный сосуд в пакете пенопластовом");
		НайтиФормуУпаковки("57eeeadf-7c4b-4614-9731-6e47d4b273a9", "Комбинированная упаковка: стеклянный сосуд в стальном барабане");
		НайтиФормуУпаковки("6355c3ee-6d1c-4bc5-a6ff-2a808274f222", "Комбинированная упаковка: стеклянный сосуд в ящике решетчатом (ИЛИ обрешетке) ИЗ алюминия");
		НайтиФормуУпаковки("5893d315-48c8-49f7-9dc4-2dde43e090b9", "Комбинированная упаковка: стеклянный сосуд в ящике решетчатом (ИЛИ обрешетке) ИЗ стали");
		НайтиФормуУпаковки("b5cd2c76-152f-4d8f-a5c2-d196dd920426", "Комплект");
		НайтиФормуУпаковки("3cb38979-51da-44a5-8bdc-8f549bb0aa68", "Конверт");
		НайтиФормуУпаковки("dddd429e-0376-4030-bb9e-2ad9cba0f3c4", "Конверт, стальной");
		НайтиФормуУпаковки("d90e17f4-8bed-46be-a1d1-9bb7f0f4d736", "Консоль Для оборудования, помещающаяся в минифургон");
		НайтиФормуУпаковки("5d753d93-c512-4f55-8fc8-0c0f1461d6a0", "Контейнер Для пищевых продуктов");
		НайтиФормуУпаковки("9ef6b142-22e7-4a1c-bc5f-7945dc5a654f", "Контейнер металлический");
		НайтиФормуУпаковки("d273dbfd-c8ed-4637-9ad2-5e40d7ecbf3a", "Контейнер наружный");
		НайтиФормуУпаковки("fedf606a-053c-11e1-99b4-d8d385fbc9e8", "Контейнер средней грузоподъемности Для массовых грузов");
		НайтиФормуУпаковки("b86afba4-7492-4910-b266-6ab67235095c", "Контейнер средней грузоподъемности Для массовых грузов алюминиевый");
		НайтиФормуУпаковки("6505c314-3e58-496e-becc-9ee71c08eacc", "Контейнер средней грузоподъемности Для массовых грузов алюминиевый герметизированный свыше 10 КПа");
		НайтиФормуУпаковки("caeda84d-f591-4ca8-888f-2b0857d6d66a", "Контейнер средней грузоподъемности Для массовых грузов бумажный многослойный");
		НайтиФормуУпаковки("566c12fc-5fc1-4189-8fc4-f4ff072c4897", "Контейнер средней грузоподъемности Для массовых грузов бумажный многослойный влагонепроницаемый");
		НайтиФормуУпаковки("800fc586-864c-4c29-ae15-d0d405e5d82a", "Контейнер средней грузоподъемности Для массовых грузов герметизированный 10 Кпа");
		НайтиФормуУпаковки("3a762c62-7b9e-4ccc-95e7-50fed26da877", "Контейнер средней грузоподъемности Для массовых грузов герметизированный свыше 10 КПа");
		НайтиФормуУпаковки("1061b465-9f46-48ba-8939-e4e14afd6270", "Контейнер средней грузоподъемности Для массовых грузов гибкий");
		НайтиФормуУпаковки("e143c99a-f5c3-4e66-a50b-52a5cabc6325", "Контейнер средней грузоподъемности Для массовых грузов ИЗ древесного материала");
		НайтиФормуУпаковки("828064d7-80be-4ba4-a13c-7a17476e763e", "Контейнер средней грузоподъемности Для массовых грузов ИЗ древесного материала с внутренним вкладышем");
		НайтиФормуУпаковки("057ea6ec-aab1-4e2c-be58-f976fd3bbb37", "Контейнер средней грузоподъемности Для массовых грузов ИЗ естественной древесины");
		НайтиФормуУпаковки("c5f0a52e-2496-45f0-9c5d-0cca7c1643a1", "Контейнер средней грузоподъемности Для массовых грузов ИЗ естественной древесины с внутренним вкладышем");
		НайтиФормуУпаковки("5cea30bc-bd13-4c2a-af79-90a2e1804b07", "Контейнер средней грузоподъемности Для массовых грузов ИЗ жесткой пластмассы");
		НайтиФормуУпаковки("e729238b-88ff-4991-a67e-8ec66cded23c", "Контейнер средней грузоподъемности Для массовых грузов ИЗ жесткой пластмассы автономный герметизированный");
		НайтиФормуУпаковки("2b58bc8f-b007-4ef4-808b-a4eedc9df54c", "Контейнер средней грузоподъемности Для массовых грузов ИЗ жесткой пластмассы с конструкционным оснащением герметизированный");
		НайтиФормуУпаковки("c159513f-dcf5-4402-ab16-8a1970e7b9d4", "Контейнер средней грузоподъемности Для массовых грузов ИЗ пластикового волокна с покрытием И вкладышем");
		НайтиФормуУпаковки("92765566-620c-4877-a58f-4107c3c6d468", "Контейнер средней грузоподъемности Для массовых грузов ИЗ полимерной пленки");
		НайтиФормуУпаковки("9c415e68-6f34-4e5c-81c2-696e994a77cc", "Контейнер средней грузоподъемности Для массовых грузов ИЗ полимерной ткани без покрытия/вкладыша");
		НайтиФормуУпаковки("fed6b6cb-60b7-4df5-b81e-37b7a2b2a24e", "Контейнер средней грузоподъемности Для массовых грузов ИЗ полимерной ткани с вкладышем");
		НайтиФормуУпаковки("3d3bf9e3-12bb-4f0c-82ab-c79df71fcfdf", "Контейнер средней грузоподъемности Для массовых грузов ИЗ полимерной ткани с покрытием");
		НайтиФормуУпаковки("778afe34-03a9-4255-89ce-78229c9d233c", "Контейнер средней грузоподъемности Для массовых грузов ИЗ прочего металла, кроме стали");
		НайтиФормуУпаковки("5a86d172-8b82-4992-b88c-8b1f80765ff5", "Контейнер средней грузоподъемности Для массовых грузов ИЗ фибрового картона");
		НайтиФормуУпаковки("769f3e00-3bc6-4b59-b201-8972cd649ccc", "Контейнер средней грузоподъемности Для массовых грузов металлический");
		НайтиФормуУпаковки("fab06db6-977d-48df-8822-fb5ef954434c", "Контейнер средней грузоподъемности Для массовых грузов составной");
		НайтиФормуУпаковки("a3ee4967-a24f-4815-8f07-9d49ffe1de53", "Контейнер средней грузоподъемности Для массовых грузов составной ИЗ гибкой пластмассы герметизированный");
		НайтиФормуУпаковки("fee9277d-adb9-4af6-aae9-3117412de104", "Контейнер средней грузоподъемности Для массовых грузов составной ИЗ жесткой пластмассы герметизированный");
		НайтиФормуУпаковки("a14e9f47-e745-4fb5-861e-642b8da576d9", "Контейнер средней грузоподъемности Для массовых грузов стальной");
		НайтиФормуУпаковки("cb247727-4eaf-49dd-85cf-6e2dd7f2a3ab", "Контейнер средней грузоподъемности Для массовых грузов текстильный без покрытия/вкладыша");
		НайтиФормуУпаковки("5c416509-50d7-464b-9455-9439604c2479", "Контейнер средней грузоподъемности Для массовых грузов текстильный с вкладышем");
		НайтиФормуУпаковки("111583f5-39e6-4b45-a941-b67d41ef4cae", "Контейнер средней грузоподъемности Для массовых грузов текстильный с покрытием");
		НайтиФормуУпаковки("0d51ebba-b636-4a01-9a3a-e1f10fcc73df", "Контейнер средней грузоподъемности Для массовых грузов текстильный с покрытием И вкладышем");
		НайтиФормуУпаковки("6bc17666-63d7-49fd-9a82-fd98ff408dff", "Контейнер средней грузоподъемности Для массовых грузов фанерный");
		НайтиФормуУпаковки("8015c596-6a81-40bc-bfca-f5961327bca4", "Контейнер средней грузоподъемности Для массовых грузов фанерный с внутренним вкладышем");
		НайтиФормуУпаковки("a41e2a9a-d9f8-43f7-8781-15da3e5713d8", "Контейнер средней грузоподъемности Для наливных грузов алюминиевый");
		НайтиФормуУпаковки("4dfaab91-aacd-4a1b-a052-f40f873e6a46", "Контейнер средней грузоподъемности Для наливных грузов ИЗ жесткой пластмассы автономный");
		НайтиФормуУпаковки("5389a88d-8a7d-4fc6-9758-4205df09bd30", "Контейнер средней грузоподъемности Для наливных грузов ИЗ жесткой пластмассы с конструкционным оснащением");
		НайтиФормуУпаковки("ceb9b05c-6a68-4663-ae9a-72c1f38e1ef8", "Контейнер средней грузоподъемности Для наливных грузов металлический");
		НайтиФормуУпаковки("dd97947e-4e78-41df-a4ef-1f34346db79e", "Контейнер средней грузоподъемности Для наливных грузов составной ИЗ гибкой пластмассы");
		НайтиФормуУпаковки("f9c0a4b5-0576-4aeb-9822-0a85f59b4c7f", "Контейнер средней грузоподъемности Для наливных грузов составной ИЗ жесткой пластмассы");
		НайтиФормуУпаковки("517d28bb-afa9-4a66-87e7-b707121a70fb", "Контейнер средней грузоподъемности Для наливных грузов стальной");
		НайтиФормуУпаковки("690e086c-89b8-4c17-8838-4478d4c2e4eb", "Контейнер средней грузоподъемности Для твердых навалочных/насыпных грузов ИЗ жесткой пластмассы автономный");
		НайтиФормуУпаковки("c979e057-03e8-4dda-8fcd-3dba27e4dfc5", "Контейнер средней грузоподъемности Для твердых навалочных/насыпных грузов ИЗ жесткой пластмассы с конструкционным оснащением");
		НайтиФормуУпаковки("9eba63f1-0e89-47a1-b75a-8c0cb099af3d", "Контейнер средней грузоподъемности Для твердых навалочных/насыпных грузов составной ИЗ гибкой пластмассы");
		НайтиФормуУпаковки("3850fb20-746c-4001-827c-5825630f7ce7", "Контейнер средней грузоподъемности Для твердых навалочных/насыпных грузов составной ИЗ жесткой пластмассы");
		НайтиФормуУпаковки("4258d946-8f37-43ac-90c2-ab29814daaeb", "Контейнер, галлон");
		НайтиФормуУпаковки("0239b3d5-ec19-498f-9379-013e4df8c882", "Контейнер, гибкий");
		НайтиФормуУпаковки("8f20bf8f-afd5-4e30-9e6b-b664f3973c16", "Контейнер, прочее транспортировочное оборудование, кроме поименованного");
		НайтиФормуУпаковки("fedf5cb4-053c-11e1-99b4-d8d385fbc9e8", "Корзина");
		НайтиФормуУпаковки("2bbef079-d872-469a-9a38-37101bba2e07", "Корзина ИЗ шпона Для ягод И фруктов");
		НайтиФормуУпаковки("4be2b716-28a4-4d33-8d3e-266ce1e34942", "Корзина с крышкой");
		НайтиФормуУпаковки("497050a3-b994-4ba4-badd-8b7fd98426ac", "Корзина с ручкой ИЗ древесины");
		НайтиФормуУпаковки("02684a03-6f18-43d0-b79d-3ce05d562435", "Корзина с ручкой, картонная");
		НайтиФормуУпаковки("ecd94698-e572-4b54-91a8-54bccd9f5644", "Корзина с ручкой, пластмассовая");
		НайтиФормуУпаковки("e3c233ff-30d4-4ee1-89ac-c19062f1a09d", "Корзина, рыбацкая");
		НайтиФормуУпаковки("2b91c7f0-2705-40a1-a180-64e20626a2a0", "Короб деревянный (лифтван) размером около 220 см (длина) x 115 см (ширина) x 220 см (высота)");
		НайтиФормуУпаковки("fedf5ad4-053c-11e1-99b4-d8d385fbc9e8", "Коробка");
		НайтиФормуУпаковки("5a5960a3-121e-4da1-8437-130b3cbc55c6", "Коробка (многооборотная) ИЗ Общего фонда транспортировочного оборудования ЕС, Еврокоробка");
		НайтиФормуУпаковки("ff3bfc50-0b9f-47cc-ada2-ac40a4a18cc0", "Коробка деревянная ИЗ естественной древесины обыкновенная");
		НайтиФормуУпаковки("fddc5698-8738-460f-b603-f49c7053b473", "Коробка деревянная ИЗ естественной древесины с плотно пригнанными стенками");
		НайтиФормуУпаковки("77b8f79a-6a69-4b4f-b0b2-a8a9f0f4ca12", "Коробка Для жидкостей");
		НайтиФормуУпаковки("9f0f9e11-cce0-4484-9a50-bc4fed7ee1e9", "Коробка ИЗ древесного материала");
		НайтиФормуУпаковки("89f4e420-504e-4b2e-9291-ae483d7e9bdd", "Коробка ИЗ естественной древесины");
		НайтиФормуУпаковки("8b1ffe26-1485-477f-8d2d-8050397beab2", "Коробка ИЗ твердой пластмассы");
		НайтиФормуУпаковки("aa308c04-0fe0-4a87-ab8c-7527b3f261f4", "Коробка ИЗ фибрового картона");
		НайтиФормуУпаковки("56e38905-209b-43cc-ac8f-3657f5ec2bdc", "Коробка, алюминиевая");
		НайтиФормуУпаковки("fedf4328-053c-11e1-99b4-d8d385fbc9e8", "Коробка, картонная");
		НайтиФормуУпаковки("50c21cb9-3e09-4cc7-a30f-c724d248e996", "Коробка, пенопластовая");
		НайтиФормуУпаковки("dae4571f-d2e8-11e4-8109-d89d67148660", "Коробка, пластмассовая");
		НайтиФормуУпаковки("9c0e3d26-e6c5-4b8e-bb47-0a4ecf8867a3", "Коробка, стальная");
		НайтиФормуУпаковки("2c76df5b-bdf1-4c36-b136-41240961deb0", "Коробка, фанерная");
		НайтиФормуУпаковки("890d2d2d-9ed5-40a5-8d6f-bad8546bfee4", "Кофр");
		НайтиФормуУпаковки("fedf6240-053c-11e1-99b4-d8d385fbc9e8", "Крюк");
		НайтиФормуУпаковки("3ae14a0a-3970-45ef-bd53-f278e217bf4f", "Кувшин, большой");
		НайтиФормуУпаковки("548062b8-8f49-4fe2-8e93-d6c5103a9113", "Кувшин, маленький");
		НайтиФормуУпаковки("5444b894-aa2b-456f-aa27-e1f470568338", "Кулек");
		НайтиФормуУпаковки("62120ab7-da8c-46f5-8d06-8cb3f9376a13", "Лента");
		НайтиФормуУпаковки("b9dec3d6-c0d8-4170-8b57-2f79042b9a8d", "Лист");
		НайтиФормуУпаковки("b883ff05-483d-4e82-be5f-c1b90d004d1c", "Лист в пакете/пачке/связке");
		НайтиФормуУпаковки("a2e60b9e-ee4d-47b5-956b-690bda852392", "Лист с пластмассовым покрытием");
		НайтиФормуУпаковки("d6831ad1-3dc9-48d0-8c92-402db32c4031", "Лист, металлический");
		НайтиФормуУпаковки("e49e5e21-09f1-4194-b637-655959ce5510", "Лист, прокладной");
		НайтиФормуУпаковки("3d72e4ec-f771-4c0d-a9b9-452dd7a08406", "Лоток");
		НайтиФормуУпаковки("ea504ad8-c159-449f-a752-1ab2eecc8fe1", "Лоток");
		НайтиФормуУпаковки("a5c9db95-0858-401c-a0f8-f1e17f44c156", "Лоток с двумя настилами без покрытия деревянный");
		НайтиФормуУпаковки("816aecc8-f89d-4bce-add3-bcea3782ebfa", "Лоток с двумя настилами без покрытия картонный");
		НайтиФормуУпаковки("2834ba2d-8030-4b5d-8812-186ff267f89c", "Лоток с двумя настилами без покрытия пластмассовый");
		НайтиФормуУпаковки("d5122def-d46e-4989-b845-9ed0754c2a07", "Лоток с одним настилом без покрытия деревянный");
		НайтиФормуУпаковки("b6b93b6c-286a-4c49-b646-bef408d4cf8b", "Лоток с одним настилом без покрытия картонный");
		НайтиФормуУпаковки("3614ce14-9970-453c-81df-9645c4c5fe2c", "Лоток с одним настилом без покрытия пластмассовый");
		НайтиФормуУпаковки("9c27dc4c-875d-4de5-af1f-d6d066e0d88f", "Лоток с одним настилом без покрытия полистироловый");
		НайтиФормуУпаковки("fedf451c-053c-11e1-99b4-d8d385fbc9e8", "Мешок");
		НайтиФормуУпаковки("c8bc51d4-de57-44ee-9492-85360eada3a5", "Мешок");
		НайтиФормуУпаковки("803b1dd4-ea8b-464e-9f7e-1bfa573c90bc", "Мешок (куль)");
		НайтиФормуУпаковки("a71f0123-63c4-440b-bce8-eb46d7a854e2", "Мешок (куль) многослойный");
		НайтиФормуУпаковки("fedf401c-053c-11e1-99b4-d8d385fbc9e8", "Мешок большой");
		НайтиФормуУпаковки("933312a8-dc11-43ee-9daa-abb240bf9e3f", "Мешок большой Для крупноразмерных навалочных грузов");
		НайтиФормуУпаковки("fedf4422-053c-11e1-99b4-d8d385fbc9e8", "Мешок бумажный многослойный");
		НайтиФормуУпаковки("9f15aaba-d9e1-43ea-8cc7-0f0a29ed7be8", "Мешок бумажный многослойный влагонепроницаемый");
		НайтиФормуУпаковки("87da1e8c-2d92-4de6-8448-6ab233f3847e", "Мешок ИЗ мешковины");
		НайтиФормуУпаковки("5080bd27-e2b5-4c27-9cb0-7004109f362f", "Мешок ИЗ полимерной пленки");
		НайтиФормуУпаковки("fedf4616-053c-11e1-99b4-d8d385fbc9e8", "Мешок ИЗ полимерной ткани");
		НайтиФормуУпаковки("c088e3b0-4d1f-4079-8ce3-eca7486da24f", "Мешок ИЗ полимерной ткани без внутреннего покрытия/вкладыша");
		НайтиФормуУпаковки("8d2b467f-d19a-49ad-9d4d-9769fc8adb68", "Мешок ИЗ полимерной ткани влагонепроницаемый");
		НайтиФормуУпаковки("c311b4f0-1f83-47ff-b5eb-085aa296a443", "Мешок ИЗ полимерной ткани, плотный");
		НайтиФормуУпаковки("f8296670-1b9b-42fa-9e29-76dc5ba0a8c0", "Мешок текстильный");
		НайтиФормуУпаковки("e50c3c66-a104-46d2-bf1c-b1fb6f649698", "Мешок текстильный без внутреннего покрытия/вкладыша");
		НайтиФормуУпаковки("84b62344-fe4f-4585-bdf2-efb3bc68d982", "Мешок текстильный влагонепроницаемый");
		НайтиФормуУпаковки("c97033bd-2cf6-4029-a570-0a59b238e68b", "Мешок текстильный плотный");
		НайтиФормуУпаковки("8bb62b02-1b8b-4d1e-8886-93c9484fa5c2", "Мешок, большой");
		НайтиФормуУпаковки("fedf5e80-053c-11e1-99b4-d8d385fbc9e8", "Мешок, бумажный");
		НайтиФормуУпаковки("fdbf9ad8-68d8-49ee-814f-b7d76d806545", "Мешок, гибкий контейнер");
		НайтиФормуУпаковки("198ddc36-88da-4659-a5a6-d9acb8416d9d", "Мешок, джутовый");
		НайтиФормуУпаковки("501e2c46-d364-44f5-9f7f-c9697115e4fd", "Мешок, пластмассовый");
		НайтиФормуУпаковки("e806470b-dcf2-447e-8394-b4144b9138df", "Мешок, рогожный");
		НайтиФормуУпаковки("577431f6-7f08-4f20-af71-7ede3ac2a564", "Мягкий мешок, Гибкая цистерна");
		НайтиФормуУпаковки("d2aeda76-b593-42c6-b6b0-dc1c8338dc54", "Набор");
		НайтиФормуУпаковки("3050ca0a-7e39-4cd4-a762-253b981bad21", "Навалом металлолом");
		НайтиФормуУпаковки("a521f8b3-eeeb-4027-941c-45928d0ecb16", "Наливом газ (при 1031 мБар И 15°C)");
		НайтиФормуУпаковки("791bd3df-24eb-466f-b575-57d9dd1f95b7", "Наливом газ сжиженный (при температуре/давлении, отличающихся от нормальных)");
		НайтиФормуУпаковки("22f90a6e-6872-4bd5-a143-063761da6e1a", "Наливом жидкость");
		НайтиФормуУпаковки("f8ca4252-9ca3-45bd-9a95-8b6a5b538208", "Насыпью твердые гранулированные частицы (гранулы)");
		НайтиФормуУпаковки("df053993-cf00-43c9-97ea-4c2fa0d07f96", "Насыпью твердые крупные частицы (мелкие куски)");
		НайтиФормуУпаковки("efb4b760-611d-4f20-80a8-273c315f4db0", "Насыпью твердые мелкие частицы (порошки)");
		НайтиФормуУпаковки("0e254eeb-d882-425d-85cf-ae68b8e50980", "Нет сведений");
		НайтиФормуУпаковки("fedf46fc-053c-11e1-99b4-d8d385fbc9e8", "Неупакованный ИЛИ нерасфасованный");
		НайтиФормуУпаковки("3fd40265-127d-4fc6-9999-1cdf62f25faf", "Неупакованный ИЛИ нерасфасованный многоместный груз");
		НайтиФормуУпаковки("2def57e9-6280-4d7d-8765-840aa86e45e1", "Неупакованный ИЛИ нерасфасованный одноместный груз");
		НайтиФормуУпаковки("ed9473f1-647c-4dfc-8ac2-3cba09217165", "Октабин");
		НайтиФормуУпаковки("fedf48dc-053c-11e1-99b4-d8d385fbc9e8", "Пакет");
		НайтиФормуУпаковки("cd449f46-29f4-42af-8d36-046f0954ae63", "Пакет (мешочек)");
		НайтиФормуУпаковки("f0b0ec9b-8341-4e95-bc0e-80898be598cb", "Пакет (пачка/связка)");
		НайтиФормуУпаковки("6fddb358-43dd-4030-a1a7-a1a3c8c489ad", "Пакет бумажный многослойный");
		НайтиФормуУпаковки("cf45058e-1f10-42fa-ae97-b2afefac9489", "Пакетик");
		НайтиФормуУпаковки("63c5ba04-a314-4d41-9a0f-d328fba0144a", "Пачка (пакет/связка)");
		НайтиФормуУпаковки("aeba3537-a7ed-4c11-8cfc-a05de5280f73", "Пачка деревянная");
		НайтиФормуУпаковки("240ef107-fad5-4fca-bad1-ae65ab388ac6", "Плита");
		НайтиФормуУпаковки("4b2de153-2c3e-499e-91f8-a7ce1926157a", "Плиты в пакете/пачке/связке");
		НайтиФормуУпаковки("a8e05c09-1c89-46a8-8362-b2388f820fdb", "По взаимному определению");
		НайтиФормуУпаковки("fedf615a-053c-11e1-99b4-d8d385fbc9e8", "Поддон");
		НайтиФормуУпаковки("fedf56f6-053c-11e1-99b4-d8d385fbc9e8", "Поддон");
		НайтиФормуУпаковки("83ee9a1e-5c1c-438b-bb63-48ed654e63ef", "Поддон 100 x 110 см");
		НайтиФормуУпаковки("280069cf-3cff-4cb3-a96d-5632944e3f9c", "Поддон в термоусадочной пленке");
		НайтиФормуУпаковки("d520e4b3-dd9b-4f34-9148-ccac220b9c84", "Поддон деревянный");
		НайтиФормуУпаковки("82286818-b97d-42ef-b5e2-d1a1ac1c18cf", "Поддон модульный с обечайкой 80 x 100 см");
		НайтиФормуУпаковки("d1d65e12-85c6-4492-8407-de44d792ac1f", "Поддон модульный с обечайкой 80 x 60 см");
		НайтиФормуУпаковки("d79600b3-7498-4a9b-a873-d58fce2a667d", "Поддон модульный с обечайкой 80 х 120 см");
		НайтиФормуУпаковки("d9d55e79-0ba6-4c11-9761-0e10dc1c6c8e", "Поддон, ящичный");
		НайтиФормуУпаковки("81b74091-f9db-436f-b6a9-2438f3fbba32", "Прут");
		НайтиФормуУпаковки("cfc437d8-9bfe-4d56-8d0e-4f35e5ae3af6", "Прут в пакете/пачке/связке");
		НайтиФормуУпаковки("c91b91dc-6dff-49f6-90eb-19824f81b675", "Пульверизатор");
		НайтиФормуУпаковки("770d2025-1d5e-463a-82bc-ce7bceb3cc90", "Рама");
		НайтиФормуУпаковки("2d523fde-44a2-4c21-891b-4bccdcb1a33e", "Рулон (обивочного ИЛИ настилочного материала)");
		НайтиФормуУпаковки("f65e0788-1ba1-46f5-b677-d7590cc6c745", "Рулон (полосового материала)");
		НайтиФормуУпаковки("07aa7b0e-2a80-45ba-b3bd-6060eef8376b", "Связка");
		НайтиФормуУпаковки("ed7372ee-8b55-4e69-aa90-956a68b836ae", "Сетка");
		НайтиФормуУпаковки("5f3d0b50-196e-498d-8994-7dfd1d9661cc", "Сетка типа используемой Для овощей ИЛИ фруктов");
		НайтиФормуУпаковки("fe9cc400-101e-4dee-a90f-705c71bb560e", "Сетка трубчатая пластмассовая");
		НайтиФормуУпаковки("1943c156-b96c-4b64-8935-dfd11e95d495", "Сетка трубчатая текстильная");
		НайтиФормуУпаковки("29f1456b-e328-4f1b-b855-41eda829a9e1", "Слитки в пакете/пачке/связке");
		НайтиФормуУпаковки("c954a839-e145-40f0-8945-de8e4faad748", "Слиток");
		НайтиФормуУпаковки("000000f8-8e27-4cb0-9e34-6d99fd90d7df", "Сляб");
		НайтиФормуУпаковки("322566af-9e46-4f63-bf22-041d4d2d9c58", "Сосуд с пластмассовым покрытием");
		НайтиФормуУпаковки("bc592630-266f-425c-be8b-911425c04ccf", "Сосуд, бумажный");
		НайтиФормуУпаковки("a7a51764-3c6d-4dec-997d-c5b08d8e2d74", "Сосуд, деревянный");
		НайтиФормуУпаковки("0509b85d-01ca-4a62-bc40-283eff6ead2d", "Сосуд, металлический");
		НайтиФормуУпаковки("876203e4-1352-455a-8c97-92c3460acc3a", "Сосуд, пластмассовый");
		НайтиФормуУпаковки("251a4096-c3d6-4b0c-8534-65b31d41f633", "Сосуд, стеклянный");
		НайтиФормуУпаковки("ef542239-f46a-4552-a332-db330f73b646", "Сосуд, фибровый");
		НайтиФормуУпаковки("6bcddbae-2d7b-455c-83b3-6a65731d4e9f", "Спичечный коробок");
		НайтиФормуУпаковки("2f2ba5e2-c9ab-41af-83d8-592f65c01db4", "Стеллаж");
		НайтиФормуУпаковки("2d3b2408-d028-42e1-bc72-941b7fa149b5", "Стойка");
		НайтиФормуУпаковки("28f26068-5294-4c8a-b409-c0a7ae10efd9", "Стойка, вешалка Для одежды");
		НайтиФормуУпаковки("ed6ec9a4-fb93-420a-9e1d-884aa58849c4", "Сундук");
		НайтиФормуУпаковки("bf12e4f9-56be-4b62-a0d6-22f01585db25", "Сундук, дорожный");
		НайтиФормуУпаковки("022887ce-8f39-4b81-b26e-785f114c7ac7", "Сундук, морской");
		НайтиФормуУпаковки("dbff7b51-2571-451e-bf15-66e2ceed2fcb", "Сундучок");
		НайтиФормуУпаковки("730968d5-30e1-4cc8-b413-d5997e8898a5", "Таблетка");
		НайтиФормуУпаковки("7c585ad5-34f3-4975-a0aa-a78229e71808", "Труба");
		НайтиФормуУпаковки("f5144819-a94a-486d-91d7-eb38a074c6c1", "Труба в пакете/пачке/связке");
		НайтиФормуУпаковки("06eb9e3a-d6a8-49c3-809a-b4150b90e210", "Трубка ИЛИ туба");
		НайтиФормуУпаковки("54d1cc31-f51c-4e2a-9230-009c57aaa517", "Трубка ИЛИ туба в пакете/пачке/связке");
		НайтиФормуУпаковки("0c009153-57e0-4dfa-8e5f-ece82ae4dfef", "Трубка ИЛИ туба с насадкой");
		НайтиФормуУпаковки("6858e1ff-229f-43e0-9b3b-dd6ac0b41485", "Трубка ИЛИ туба, складывающаяся");
		НайтиФормуУпаковки("eb23a947-4fd9-46e6-8a6f-f258433500e7", "Упаковка");
		НайтиФормуУпаковки("7ca4b4f3-fcac-4c00-8d7a-b258acaa97f0", "Упаковка в оберточной бумаге");
		НайтиФормуУпаковки("b5dd6d4d-b99e-4245-8a92-abc119e1889f", "Упаковка демонстрационная деревянная");
		НайтиФормуУпаковки("67129e5f-36d2-4397-8122-0c18747d2344", "Упаковка демонстрационная картонная");
		НайтиФормуУпаковки("add23067-88c7-4cc0-a251-8c67953d00ce", "Упаковка демонстрационная металлическая");
		НайтиФормуУпаковки("dfe5cf21-dbc5-4f51-b7fd-ad45259f9677", "Упаковка демонстрационная пластмассовая");
		НайтиФормуУпаковки("c2645eda-085d-4ae7-bfc2-641fc380ebae", "Упаковка картонная с отверстиями Для бутылок");
		НайтиФормуУпаковки("9b0b180a-7cbb-4d9a-ba41-fd08b0eae3ba", "Упаковка, выпрессованная");
		НайтиФормуУпаковки("ec874c34-8d51-4e04-bd2c-9ec9642d1e0e", "Упаковка, выставочная");
		НайтиФормуУпаковки("a283d481-0a41-4d0a-9c38-e386caac0d70", "Флакон");
		НайтиФормуУпаковки("2ca9172d-edad-4d6f-a4b8-e4fbaae098cb", "Фляга");
		НайтиФормуУпаковки("07c59e7c-4a8c-4035-8048-2847491c88ea", "Цилиндр");
		НайтиФормуУпаковки("fedf5d9a-053c-11e1-99b4-d8d385fbc9e8", "Цистерна контейнер универсальный");
		НайтиФормуУпаковки("a5e4fb2f-f40b-40ab-bd2d-f6ddabbd4460", "Цистерна, прямоугольная");
		НайтиФормуУпаковки("6fd54b8c-d35a-4655-b2f2-2491429b0931", "Цистерна, цилиндрическая");
		НайтиФормуУпаковки("59eac884-a3ee-4c87-86ef-2508d1328ee6", "Чайная коробка");
		НайтиФормуУпаковки("6eb46a7f-f1c0-49fd-b38c-47c8177aa9e1", "Чан");
		НайтиФормуУпаковки("bfbecab2-acff-4791-8f4f-b03d435d00c8", "Чаша");
		НайтиФормуУпаковки("8f4c7cbd-7d4a-48d6-873f-9f4a37bd576c", "Чемодан");
		НайтиФормуУпаковки("354aee98-06a3-4780-bc9a-00a57edd8ca7", "Чехол");
		НайтиФормуУпаковки("62f322c4-ce6d-4584-ba3f-4c771406f54d", "Шар");
		НайтиФормуУпаковки("0bf57833-4b9d-4d99-96a3-53c7263e01e6", "Шина");
		НайтиФормуУпаковки("dd7b8b5b-fcf3-46bf-9955-e2c5f9cc25f6", "Шпиндель");
		НайтиФормуУпаковки("969bfad0-be8f-43fe-84d8-32ebfe32d37d", "Шпулька");
		НайтиФормуУпаковки("25b9eab3-0f9f-42c1-912b-10f78bc63901", "Штабель");
		НайтиФормуУпаковки("6090531d-d038-4f6c-a8df-77ba92267ec4", "Штука");
		НайтиФормуУпаковки("bd8a4719-4595-4e82-a2e6-9ea20afcbf6e", "Ящик");
		НайтиФормуУпаковки("7c29a864-e469-4c64-89e7-153000939d61", "Ящик");
		НайтиФормуУпаковки("563fadd5-faa2-4d28-9139-1f23e08ae0af", "Ящик автомобильный");
		НайтиФормуУпаковки("61079f21-ef62-44bc-97a7-817029f4d251", "Ящик деревянный");
		НайтиФормуУпаковки("3d01bd9f-6629-4ec1-9ebe-532d82379a14", "Ящик деревянный");
		НайтиФормуУпаковки("d8f7a02c-5076-41a2-9258-cca3427993b4", "Ящик металлический");
		НайтиФормуУпаковки("668f1a9f-3b4c-496a-8c01-c6d1bd87d917", "Ящик решетчатый (ИЛИ обрешетка) мелкий");
		НайтиФормуУпаковки("aabbf190-ba1f-4611-8a97-6ce660a1dbc3", "Ящик решетчатый (ИЛИ обрешетка) многослойный деревянный");
		НайтиФормуУпаковки("f1a52766-b434-4e89-8440-60ba8df518c3", "Ящик решетчатый (ИЛИ обрешетка) многослойный картонный");
		НайтиФормуУпаковки("5fc55705-10dd-4071-a5ec-bd2337e98b95", "Ящик решетчатый (ИЛИ обрешетка) многослойный пластмассовый");
		НайтиФормуУпаковки("c1444369-7a47-4e53-8e62-c33c290d73c2", "Ящик решетчатый (ИЛИ обрешетка) рамный");
		НайтиФормуУпаковки("fe47d256-3d2b-4460-87e3-349ee65f6ac0", "Ящик решетчатый Для бутылок");
		НайтиФормуУпаковки("e879ae24-cac7-4dd1-a0e5-1d433b3493ab", "Ящик решетчатый Для массовых грузов деревянный");
		НайтиФормуУпаковки("ebf8776f-0e3d-4aff-bc64-28fb6e93a6fb", "Ящик решетчатый Для массовых грузов картонный");
		НайтиФормуУпаковки("7c4ea86f-477d-499e-b9b5-281c8d7cb2a5", "Ящик решетчатый Для массовых грузов пластмассовый");
		НайтиФормуУпаковки("dcf6eeb2-a0fd-4f1c-83db-7a85354a7c84", "Ящик решетчатый Для молока");
		НайтиФормуУпаковки("9e2b9bfb-8f54-4a66-ad38-d650ca479e44", "Ящик решетчатый Для пива");
		НайтиФормуУпаковки("3ea227b5-df09-40c2-b802-8abd1427c73e", "Ящик решетчатый Для фруктов");
		НайтиФормуУпаковки("93266aa3-4642-4162-8155-01851a5c0811", "Ящик с поддоном");
		НайтиФормуУпаковки("a106dd9b-f9ee-45d6-a4f7-d8c18a1c53ea", "Ящик с поддоном деревянный");
		НайтиФормуУпаковки("dbb7a1d0-aa1f-4141-90e2-1db559dd20f7", "Ящик с поддоном картонный");
		НайтиФормуУпаковки("4ad07608-39ee-4991-baac-9cd2bdb5b2b0", "Ящик с поддоном металлический");
		НайтиФормуУпаковки("215592ec-b08d-401b-800d-d36bda9ba0b5", "Ящик с поддоном пластмассовый");
		НайтиФормуУпаковки("a451a297-b510-48fc-8a31-a41e311a0d82", "Ящик, изотермический");
		НайтиФормуУпаковки("5bca0d26-c06d-4fbd-a75a-39b098f7a5d8", "Ящик, каркасный");
		НайтиФормуУпаковки("e2437340-c529-4655-9774-c61054d429a5", "Ящик, решетчатый (ИЛИ обрешетка)");
		НайтиФормуУпаковки("a4992438-8d0c-45b2-9ffd-669dff708417", "Ящик, стальной");
		
		РезультатОбработки = Новый Структура();
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Истина);
		ВетИС_APIСервер.СообщитьИнфо("ВСД_ФормыУпаковки загрузка завершена");
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при получении ВСД_ФормыУпаковки '"),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		//ОтменитьТранзакцию();
		
		РезультатОбработки = Новый Структура();
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Ложь);
		
		ВетИС_APIСервер.СообщитьИнфо("Ошибка при получении ВСД_ФормыУпаковки ");
		ВетИС_APIСервер.СообщитьИнфо(ОписаниеОшибки());
	КонецПопытки;
	
	//ЗафиксироватьТранзакцию();
	
	ПоместитьВоВременноеХранилище(РезультатОбработки, АдресХранилища);
	
КонецПроцедуры

Функция ВСД_ЦельНайтиПоGuid(ЦельGuid) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВСД_Цель.Ссылка КАК Цель
	|ИЗ
	|	Справочник.ВСД_Цель КАК ВСД_Цель
	|ГДЕ
	|	ВСД_Цель.GUID ПОДОБНО &GUID
	|	И НЕ ВСД_Цель.ПометкаУдаления";
	Запрос.УстановитьПараметр("GUID", СокрЛП(ЦельGuid));
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Ответ = Результат.Цель;
	Иначе
		Ответ = Справочники.ВСД_Цель.ПустаяСсылка();
		ВетИС_APIСервер.СообщитьИнфо("Цель с Guid ["+ЦельGuid+"]не найдена, выполните инициализацию.");
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции


// GRACE:MODULE_END name="ВетИС_API_НСИСервер"
