
&НаСервере
Процедура ВыполнитьНаСервере(ПараметрКоманды)
	
	Организация = ВетИС_ПараметрыСервер.ПолучитьОрганизациюПоУмолчанию();
	ПараметрыОрганизации = ВетИС_ЯдроСервер.ЗагрузитьПараметры(Организация);
	
	Для Каждого элемент Из ПараметрКоманды Цикл
		ВетИС_APIСервер.Продукция_Элемент_Получить_Инфо(ПараметрыОрганизации, элемент);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Состояние("Выполняем запрос Получение инфо о Продукции",, "Ожидайте...", БиблиотекаКартинок.kb99_wrench);
	
	ВыполнитьНаСервере(ПараметрКоманды);
	
	ПоказатьОповещениеПользователя("Операция завершена");
	
	ПараметрыВыполненияКоманды.Источник.ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры
