
&НаСервере
Процедура ВыполнитьНаСервере(ПараметрКоманды)

	Организация = ВетИС_ПараметрыСервер.ПолучитьОрганизациюПоУмолчанию();
	ПараметрыОрганизации = ВетИС_ЯдроСервер.ЗагрузитьПараметры(Организация);
	
	//Для Каждого элемент Из ПараметрКоманды Цикл
	ВетИС_APIСервер.Площадка_ЗагрузитьПоХозСубъекту(ПараметрыОрганизации, ПараметрКоманды, Истина);
	//КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Состояние("Выполняем запрос",, "Ожидайте...", БиблиотекаКартинок.kb99_wrench);
	
	ВыполнитьНаСервере(ПараметрКоманды);
	
	ПоказатьОповещениеПользователя("Операция завершена");
	
	Оповестить("ЗагруженыПлощадкиПоХозсубъекту");
	
КонецПроцедуры