
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ВыбКоманда     = "UPDATE";
	ТекстВопроса   = "Изменить продукцию в Меркурий?";
	ТекстСостояния = "Выполняем запрос на изменение продукции";
	
	СтруктураКоманды = Новый Структура;
	СтруктураКоманды.Вставить("ВыбКоманда"    , ВыбКоманда);
	СтруктураКоманды.Вставить("ТекстВопроса"  , ТекстВопроса);
	СтруктураКоманды.Вставить("ТекстСостояния", ТекстСостояния);
	
	ВетИС_КомандыКлиент.кб99_ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды, СтруктураКоманды);
	
КонецПроцедуры
