&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = ВетИС_ПараметрыСервер.ПолучитьОрганизациюПоУмолчанию();
	Период.ДатаНачала = НачалоДня(ТекущаяДатаСеанса());
	Период.ДатаОкончания = КонецДня(ТекущаяДатаСеанса());
	ОтборПоСтатусу = 2;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УстановитьОтбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	УстановитьОтбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСтатусуПриИзменении(Элемент)
	
	УстановитьОтбор();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		ТекКолонка = Поле;
		ИмяКолонки = ТекКолонка.Имя;
		
		Если ИмяКолонки = "СписокДокументовОснование" Тогда 
			
			ВетИС_КлиентскийСлойКлиент.ПоказатьЗначение_СОбработкой(
					ТекущиеДанные.Основание, ЭтаФорма, "ОбработчикОбновитьДинамическийСписок");
			
		ИначеЕсли ИмяКолонки = "СписокДокументовКорректировкаВСД" Тогда 
			
			ВетИС_КлиентскийСлойКлиент.ПоказатьЗначение_СОбработкой(
					ТекущиеДанные.КорректировкаВСД, ЭтаФорма, "ОбработчикОбновитьДинамическийСписок");
			
		Иначе
			
			ВыполнитьТребуемоеДействие(ТекущиеДанные);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОбновитьДинамическийСписок(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Элементы.ЗадачиДинамическийСписок.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьТребуемоеДействие(ТекущиеДанные)
	
	Документ = ТекущиеДанные.Основание; 
	ТребуемоеДействие = ТекущиеДанные.ДальнейшееДействие;
	
	// Требуемое действие может смениться в любую миллисекунду	 
	Если ТребуемоеДействие = "Оформить" Тогда 
		
		ВетИС_КлиентскийСлойКлиент.СоздатьИлиОткрытьКорректировкуВСД(Документ);
		
	ИначеЕсли ТребуемоеДействие = "Не требуется" Или ТребуемоеДействие = "Обработать" Тогда
		
		ВетИС_КлиентскийСлойКлиент.ПоказатьЗначение_СОбработкой(ТекущиеДанные.КорректировкаВСД, ЭтаФорма,
			"ОбработчикОбновитьДинамическийСписок");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтбор()
	
	ОтборДинамическогоСписка = СписокДокументов.КомпоновщикНастроек.ФиксированныеНастройки.Отбор;
	ОтборДинамическогоСписка.Элементы.Очистить();
	
	ЭлементОтбора = ОтборДинамическогоСписка.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Организация;
	ЭлементОтбора.Использование = ЗначениеЗаполнено(Организация);
	
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("НачалоПериода",		 Период.ДатаНачала);
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("ОкончаниеПериода",	 Период.ДатаОкончания);
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("ОтборПоСтатусу",	 ОтборПоСтатусу);

КонецПроцедуры
